#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// GalaktionovVA; Выделение подсистемы ЛИС - Старт
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	// GalaktionovVA; Выделение подсистемы ЛИС - Финиш
	
КонецПроцедуры

#КонецОбласти
