
Функция ПечатьАктОтбораПроб(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_АктОтбораПроб_АктОтбораПроб";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_АктОтбораПроб.ПФ_MXL_АктОтбораПроб");
		
	Для каждого ТекущийОбъект из МассивОбъектов Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка
		Область = Макет.ПолучитьОбласть("ОбластьШапка");
		Область.Параметры.Заполнить(ТекущийОбъект);
		//Область.Параметры.АдресФилиала = ;
		ТабличныйДокумент.Вывести(Область);
		
		// Строки
		Для каждого Проба из ТекущийОбъект.Пробы Цикл
			
			Область = Макет.ПолучитьОбласть("ОбластьСтрока");
			Область.Параметры.Заполнить(Проба);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	    // Подвал
		Область = Макет.ПолучитьОбласть("ОбластьПодвал");
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции	

Функция ПечатьЖурналаОтбораПробВоды(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_АктОтбораПроб_ЖурналОтбораПробВоды";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробВоды");
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Шапка
	Область = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(Область);
	
	РазделыУчета = Новый Массив;
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.ПриродныеВоды);
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.СточныеВоды);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазделыУчета", РазделыУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	лис_АктОтбораПробПробы.Ссылка.ВремяИДатаДоставкиВЛабораторию КАК ДатаВремяПоступления,
	               |	лис_АктОтбораПробПробы.Ссылка.ДатаОтбора КАК ДатаВремяОтбора,
	               |	лис_АктОтбораПробПробы.Ссылка.Заказчик КАК ОрганизацияЗаказчик,
	               |	лис_АктОтбораПробПробы.Ссылка.ОтобралПробу КАК ПробуОтобрал,
	               |	лис_АктОтбораПробПробы.ТочкаОтбораПробы КАК ТочкиОтбора,
	               |	ВложенныйЗапрос.НомерПротоколаРезультатов,
	               |	ВложенныйЗапрос.ДатаВыдачи
	               |ИЗ
	               |	Документ.лис_АктОтбораПроб.Пробы КАК лис_АктОтбораПробПробы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПротоколАнализаСточныхВод.Ссылка КАК Ссылка,
	               |			ПротоколАнализаСточныхВод.НомерПротокола КАК НомерПротоколаРезультатов,
	               |			ПротоколАнализаСточныхВод.ДатаПротокола КАК ДатаВыдачи
	               |		ИЗ
	               |			Документ.ПротоколАнализаСточныхВод КАК ПротоколАнализаСточныхВод
	               |		ГДЕ
	               |			ПротоколАнализаСточныхВод.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО лис_АктОтбораПробПробы.Ссылка = ВложенныйЗапрос.Ссылка.лис_АктОтбора
	               |ГДЕ
	               |	лис_АктОтбораПробПробы.Ссылка.РазделУчета В(&РазделыУчета)";
	Результат = Запрос.Выполнить().Выгрузить();	
	
	// Строки
	Для каждого Проба из Результат Цикл
		
		Область = Макет.ПолучитьОбласть("ОбластьСтрока");
		Область.Параметры.Заполнить(Проба);
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПечатьЖурналаОтбораПробПочвы(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_АктОтбораПроб_ЖурналОтбораПробПочвы";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробПочвы");
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Шапка
	Область = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(Область);
	
	РазделыУчета = Новый Массив;
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения);
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.Почвы);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазделыУчета", РазделыУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	лис_АктОтбораПробПробы.Ссылка.РегистрационныйНомерПробы КАК РегистрационныйНомер,
	               |	лис_АктОтбораПробПробы.Ссылка.Организация КАК Филиал,
	               |	лис_АктОтбораПробПробы.Ссылка.Номер КАК АктОтбора,
	               |	лис_АктОтбораПробПробы.Ссылка.ДатаОтбора КАК ДатаОтбора,
	               |	лис_АктОтбораПробПробы.ОпределяемыйПоказатель КАК Проба,
	               |	лис_АктОтбораПробПробы.ШифрПробы
	               |ИЗ
	               |	Документ.лис_АктОтбораПроб.Пробы КАК лис_АктОтбораПробПробы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПротоколАнализаПочвДонныхОтложений.Ссылка КАК Ссылка,
	               |			ПротоколАнализаПочвДонныхОтложений.НомерПротокола КАК НомерПротокола,
	               |			ПротоколАнализаПочвДонныхОтложений.ДатаПротокола КАК ДатаПротокола
	               |		ИЗ
	               |			Документ.ПротоколАнализаПочвДонныхОтложений КАК ПротоколАнализаПочвДонныхОтложений
	               |		ГДЕ
	               |			ПротоколАнализаПочвДонныхОтложений.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО лис_АктОтбораПробПробы.Ссылка = ВложенныйЗапрос.Ссылка.лис_АктОтбора
	               |ГДЕ
	               |	лис_АктОтбораПробПробы.Ссылка.РазделУчета В(&РазделыУчета)";
	Результат = Запрос.Выполнить().Выгрузить();	
	
	// Строки
	Для каждого Проба из Результат Цикл
		
		Область = Макет.ПолучитьОбласть("ОбластьСтрока");
		Область.Параметры.Заполнить(Проба);
		Область.Параметры.ВремяОтбора = Проба.ДатаОтбора;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции


// Формирует печатные формы
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОтбораПроб") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктОтбораПроб", "Акт отбора проб",
			ПечатьАктОтбораПроб(МассивОбъектов, ОбъектыПечати),, "Документ.лис_АктОтбораПроб.ПФ_MXL_АктОтбораПроб");
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОтбораПробВоды") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОтбораПробВоды", "Журнал отбора проб воды",
			ПечатьЖурналаОтбораПробВоды(МассивОбъектов, ОбъектыПечати),, "Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробВоды");
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОтбораПробПочвы") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОтбораПробПочвы", "Журнал отбора проб почвы",
			ПечатьЖурналаОтбораПробПочвы(МассивОбъектов, ОбъектыПечати),, "Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробПочвы");
		
	КонецЕсли; 
	
КонецПроцедуры

