
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр лис_ОтборПроб
	Движения.лис_ОтборПроб.Записывать = Истина;
	Для Каждого ТекСтрокаПробы Из Пробы Цикл
		Движение = Движения.лис_ОтборПроб.Добавить();
		Движение.Период = Дата;
		Движение.ШифрПробы = ТекСтрокаПробы.ШифрПробы;
		Движение.ОбъемПробы = ТекСтрокаПробы.ОбъемПробы;
		Движение.ТочкаОтбораПробы = ТекСтрокаПробы.ТочкаОтбораПробы;
		Движение.ОпределяемыйПоказатель = ТекСтрокаПробы.ОпределяемыйПоказатель;
		Движение.ЕмкостиДляОтбораПроб = ТекСтрокаПробы.ЕмкостиДляОтбораПроб;
		Движение.ЕдиницаИзмерения = ТекСтрокаПробы.ЕдиницаИзмерения;
		Движение.КонсервантыДляАнализа = ТекСтрокаПробы.КонсервантыДляАнализа;
		Движение.Примечание = ТекСтрокаПробы.Примечание;
	КонецЦикла;

	// регистр лис_ОтобранныеПробы Приход
	Движения.лис_ОтобранныеПробы.Записывать = Истина;
	Для Каждого ТекСтрокаПробы Из Пробы Цикл
		Движение = Движения.лис_ОтобранныеПробы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДатаОтбора = ДатаОтбора;
		Движение.РегистрационныйНомерПробы = РегистрационныйНомерПробы;
		Движение.ШифрПробы = ТекСтрокаПробы.ШифрПробы;
		Движение.ОбъемПробы = ТекСтрокаПробы.ОбъемПробы;
		Движение.ЕдиницаИзмерения = ТекСтрокаПробы.ЕдиницаИзмерения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

// galaktionovva; Улучшение #70 - Начало
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РазделУчета = Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.ПромышленныеВыбросы Тогда 
		ТочкаОтбораПробы = ПроверяемыеРеквизиты.Найти("Пробы.ТочкаОтбораПробы");
		Если Не ТочкаОтбораПробы = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ТочкаОтбораПробы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// galaktionovva; Улучшение #70 - Конец
