#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаСброса") И ЗначениеЗаполнено(Параметры.ДатаСброса) Тогда
		
		СписокДокументов = ПолучитьСписокРазрешенийПоДате(Параметры.ДатаСброса);
		
		ЭлементОтбора					 = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		 = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения		 = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование		 = Истина;
		ЭлементОтбора.ПравоеЗначение	 = СписокДокументов;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокРазрешенийПоДате(ДатаСброса)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РазрешениеНаСбросВВодуТаблицаВыпусков.Ссылка КАК Ссылка,
		|	РазрешениеНаСбросВВодуТаблицаВыпусков.НачалоДействияРазрешения,
		|	РазрешениеНаСбросВВодуТаблицаВыпусков.КонецДействияРазрешения
		|ИЗ
		|	Документ.РазрешениеНаСбросВВоду.ТаблицаВыпусков КАК РазрешениеНаСбросВВодуТаблицаВыпусков
		|ГДЕ
		|	&ДатаСброса МЕЖДУ РазрешениеНаСбросВВодуТаблицаВыпусков.НачалоДействияРазрешения И КОНЕЦПЕРИОДА(РазрешениеНаСбросВВодуТаблицаВыпусков.КонецДействияРазрешения, День)");
		
	Запрос.УстановитьПараметр("ДатаСброса", ДатаСброса);
	
	ТаблицаДокументов	 = Запрос.Выполнить().Выгрузить();
	
	СписокДокументов	 = Новый СписокЗначений;
	
	СписокДокументов.ЗагрузитьЗначения(ТаблицаДокументов.ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокДокументов;
	
КонецФункции

#КонецОбласти
