#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацииСписокПриАктивизацииСтроки(Элемент)
	
	ОрганизацияОтбора = ОпределитьТекущуюОрганизациюСписка();
	
	Если ОрганизацияОтбора = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОрганизацияОтбора, , , Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОрганизацияОтбора, , , Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОпределитьТекущуюОрганизациюСписка()
	
	ОрганизацияОтбора = Неопределено;
	
	ТекущиеДанные = Элементы.ОрганизацииСписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		ОрганизацияОтбора = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияОтбора;
	
КонецФункции

#КонецОбласти
