#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

	ПереключательРазрешения = "Полный";
	
	Если ЗначениеЗаполнено(Параметры.ДействующееРазрешение) = Истина Тогда
		
		ДанныеРазрешения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ДействующееРазрешение, "РегистрационныйНомер, ДатаВыдачи, ТаблицаЗВ");
		
		ТаблицаЗВРазрешения = ДанныеРазрешения.ТаблицаЗВ.Выгрузить();
		ПереченьЗВРазрешения.ЗагрузитьЗначения(ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаЗВРазрешения,"ЗагрязняющееВещество"));
		
		СтрокаРазрешения = "№ " + ДанныеРазрешения.РегистрационныйНомер + " от " + Формат(ДанныеРазрешения.ДатаВыдачи,"ДФ=dd.MM.yyyy");
		
	Иначе 
		
		Элементы.ПереключательРазрешения.Видимость = Ложь;
		
		СтрокаРазрешения = "Сброс без документа разрешения";
		
	КонецЕсли;
	
	ПереключательРазрешения = "Полный";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ПереключательРазрешенияПриИзменении(Элемент)
	
	Если ПереключательРазрешения = "Полный" Тогда
	
		Список.Отбор.Элементы.Очистить();
		
	ИначеЕсли ПереключательРазрешения = "ИзДокументаРазрешения" Тогда

		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.ПравоеЗначение   = ПереченьЗВРазрешения;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

