#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;		

КонецПроцедуры // Процедура ПриЗаписи(Отказ)

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток,
		|	ЛицензионныеУчастки.Организация
		|ИЗ
		|	Справочник.ЛицензионныеУчастки КАК ЛицензионныеУчастки
		|ГДЕ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток = &НомерУчастка
		|	И ЛицензионныеУчастки.Организация = &Организация";
		
		Запрос.УстановитьПараметр("НомерУчастка", ЭтотОбъект.ЛицензионныйУчасток);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Пара полей ""Лицензионный участок"" и ""Организация"" не уникальна!'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток,
		|	ЛицензионныеУчастки.Организация
		|ИЗ
		|	Справочник.ЛицензионныеУчастки КАК ЛицензионныеУчастки
		|ГДЕ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток = &НомерУчастка
		|	И ЛицензионныеУчастки.Организация = &Организация
		|	И НЕ ЛицензионныеУчастки.Ссылка = &Объект";
		
		Запрос.УстановитьПараметр("НомерУчастка", ЭтотОбъект.ЛицензионныйУчасток);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Объект", Этотобъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Пара полей ""Лицензионный участок"" и ""Организация"" не уникальна!'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;    
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли

