
&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	ОткрытьФорму("Документ.АттестатАккредитации.Форма.ФормаЗагрузкиПриложенияИзExcel", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Перем Поле;
	
	// дата окончания действия
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДействия)  Тогда
		Если (Объект.ДатаОкончанияДействия <= Объект.ДатаВнесенияВРеестр) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания действия должна быть больше даты внесения в реестр'"),,"ДатаОкончанияДействия","Объект",Отказ);
		КонецЕсли;
		
		Если (Объект.ДатаОкончанияДействия <= Объект.ДатаВыдачи) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания действия должна быть больше даты выдачи'"),,"ДатаОкончанияДействия","Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// приложение - диапазоны
	Для каждого ТекСтр Из Объект.Приложение Цикл
		Если ТекСтр.ДиапазонОт > ТекСтр.ДиапазонДо Тогда
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Приложение",ТекСтр.НомерСтроки,"ДиапазонОт");
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нижняя граница диапазона должна быть меньше или равна верхней'"),,Поле,"Объект",Отказ);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// вызовем проверку заполнения дополнительно при записи (при проведении вызывается автоматически)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = НЕ ПроверитьЗаполнение();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

