#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Если 	Запись.Коэффициент = Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух Или 
			Запись.Коэффициент = Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода Или 
			Запись.Коэффициент = Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы Тогда
		ЭтаФорма.Элементы.ОКТМО.Видимость = Истина;
	ИНаче
		ЭтаФорма.Элементы.ОКТМО.Видимость = Ложь;		
	КонецЕсли;
	
	Если Запись.Коэффициент = Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода
		//++Орлов(Начало 20.04.2017
		Или Запись.Коэффициент = Справочники.Коэффициенты.КоэффициентВзвешенныхВеществ Тогда
		//--Орлов
		
		ЭтаФорма.Элементы.БассейновыйОкруг.Видимость = Истина;
	ИНаче
		ЭтаФорма.Элементы.БассейновыйОкруг.Видимость = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	
	УстановитьВидимость();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если 	Запись.Коэффициент <> Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух И 
			Запись.Коэффициент <> Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода И 
			Запись.Коэффициент <> Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы Тогда
		ТекущийОбъект.ОКТМО = Справочники.ОКТМО.ПустаяСсылка();
	КонецЕсли;
	
	Если Запись.Коэффициент <> Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода
		//++Орлов(Начало 20.04.2017
		И Запись.Коэффициент <> Справочники.Коэффициенты.КоэффициентВзвешенныхВеществ  Тогда
		//--Орлов	
		
		ТекущийОбъект.БассейновыйОкруг = Справочники.ВодохозяйственныеУчастки.ПустаяСсылка();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
