
#Область ПрограммныйИнтерфейс

// Производит обновление данных справочника веществ, загрязняющих атмосферу 
//
Процедура ОбновитьСправочник() Экспорт
	
	КлассификаторТекст = ПолучитьМакет("КлассификаторЗВАтмосфера");
	КлассификаторТекст.Записать(КаталогВременныхФайлов() + "temp.xml");
	КлассификаторТекст = Неопределено;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(КаталогВременныхФайлов() + "temp.xml");
	
	Если ЧтениеXML.Прочитать() Тогда
		ЧтениеXML.Прочитать();
		ЧтениеXML.Прочитать();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			Объект = ПрочитатьXML(ЧтениеXML);
			Объект.Записать();
		КонецЦикла; 
	КонецЕсли;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры 

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

#КонецОбласти
