
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ПроверитьДубли(Отказ);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Проверка дублей перед записью, выдача сообщений
//
// Параметры:
//  Отказ  - Булево - Возвращаемое значение, Истина - если в справочнике обнаружен дубль записываемого элемента
//
Процедура ПроверитьДубли(Отказ)
	
	ПроверяемыеРеквизиты = Новый Структура("Наименование", ЭтотОбъект.Наименование);
	ПроверкаПройдена = лис_ОбщегоНазначенияСервер.ЭтоУникальныйЭлемент(ЭтотОбъект, ПроверяемыеРеквизиты);
	
	Если НЕ ПроверкаПройдена Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Элемент справочника с таким наименованием уже существует",,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьДубли()


#КонецОбласти