
&НаКлиенте
Процедура ОткрытьСведенияОбОборудовании(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	ПараметрыФормы = СформироватьСтруктуруСведений(ТекущаяСтрока);
	ОткрытьФорму("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.СведенияОбОборудовании", ПараметрыФормы
				,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры


&НаСервере
Функция СформироватьСтруктуруСведений(ТекущаяСтрока)
	
	ПараметрыФормы = Новый Структура("Организация, Лаборатория, Оборудование, РегистрационныйНомер, ИнвентарныйНомер, ЗаводскойНомер, 
								| ЗаводскоеОбозначение, НомерПаспортаНаОборудование, ДатаИзготовления, 
								| ДатаВводаВЭксплуатацию, СрокДопустимойЭксплуатации");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущаяСтрока);
	
	Возврат ПараметрыФормы;
	
КонецФункции
