#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВычислитьЗначениеФормулыНаСервере()
	
	Возврат Справочники.МетодикиОпределенияИзмеренияАнализа.ВычислитьЗначениеФормулы(Запись.Методика, ПоказателиФормулы.Выгрузить());	
		
КонецФункции

&НаСервере
Процедура ЗаполнитьПоказателиФормулы()
	
	ПоказателиФормулы.Загрузить(Запись.Методика.ПоказателиФормулы.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоказателейФормулы()
	
	НаборЗаписей = РегистрыСведений.лис_ПоказателиРасчетовСодержанияКомпонентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Запись.Документ);
	НаборЗаписей.Отбор.АктОтбора.Установить(Запись.АктОтбора);
    НаборЗаписей.Отбор.ТочкаОтбораПробы.Установить(Запись.ТочкаОтбораПробы);
    НаборЗаписей.Отбор.ОпределяемыйПоказатель.Установить(Запись.ОпределяемыйПоказатель);
    НаборЗаписей.Отбор.ШифрПробы.Установить(Запись.ШифрПробы);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Для каждого Строка из НаборЗаписей Цикл 
			Отбор = новый Структура("Показатель", Строка.Показатель);
			НайденныеСтроки = ПоказателиФормулы.НайтиСтроки(Отбор);
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				НайденнаяСтрока.Значение = Строка.Значение;
			КонецЦикла;
		КонецЦикла;
		
	Иначе   
		
		Для каждого СтрокаТаблицы из ПоказателиФормулы Цикл
			Если СтрокаТаблицы.Показатель = "V" Тогда
				СтрокаТаблицы.Значение = Запись.ОбъемПробы;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Функция РасчитатьСреднююОптическуюПлотность()
	
	Запись.ОптическаяПлотностьСреднее = (Запись.ОптическаяПлотность1 + Запись.ОптическаяПлотность2 + Запись.ОптическаяПлотность3 + Запись.ОптическаяПлотность4) / 4;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьПоказателиФормулы();

	ЗаполнитьЗначенияПоказателейФормулы();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.лис_ПоказателиРасчетовСодержанияКомпонентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Запись.Документ);
	НаборЗаписей.Отбор.АктОтбора.Установить(Запись.АктОтбора);
    НаборЗаписей.Отбор.ТочкаОтбораПробы.Установить(Запись.ТочкаОтбораПробы);
    НаборЗаписей.Отбор.ОпределяемыйПоказатель.Установить(Запись.ОпределяемыйПоказатель);
    НаборЗаписей.Отбор.ШифрПробы.Установить(Запись.ШифрПробы);
	
	Для каждого СтрокаТаблицы из ПоказателиФормулы Цикл
		НС = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Запись);
		ЗаполнитьЗначенияСвойств(НС, СтрокаТаблицы); 
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры


&НаКлиенте
Процедура ОбъемПробыПриИзменении(Элемент)

	Для каждого СтрокаТаблицы из ПоказателиФормулы Цикл
		Если СтрокаТаблицы.Показатель = "V" Тогда
			СтрокаТаблицы.Значение = Запись.ОбъемПробы;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность1ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность2ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность3ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность4ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры


&НаКлиенте
Процедура МетодикаПриИзменении(Элемент)

	ЗаполнитьПоказателиФормулы();
	
	ЗаполнитьЗначенияПоказателейФормулы();
	
КонецПроцедуры


&НаКлиенте
Процедура ВычислитьЗначениеФормулы(Команда)
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	Если не ЗначениеЗаполнено(Запись.Методика) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена методика.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Методика", "Запись", ЕстьОшибкиЗаполнения);
	КонецЕсли;
	
	Для Счетчик = 0 по ПоказателиФормулы.Количество()-1 Цикл
		Если не ЗначениеЗаполнено(ПоказателиФормулы[Счетчик].Значение) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено значение показателя.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ПоказателиФормулы[" + Счетчик + "].Значение", , ЕстьОшибкиЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибкиЗаполнения Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеФормулы = ВычислитьЗначениеФормулыНаСервере();
	
	Если ЗначениеФормулы = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось вычислить значение по формуле.'");
		ПоказатьПредупреждение( , ТекстСообщения);
	КонецЕсли;
	
	Запись.СодержаниеПоРасчету = ЗначениеФормулы;

КонецПроцедуры

#КонецОбласти



