#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {EXTCODE 01.03.2016 17:00:38 Кузнецов Д.В., Исправил, 
	//Если ЗначениеЗаполнено(Параметры.ДатаВыброса) Тогда // было
	Если Параметры.Свойство("ДатаВыброса") И ЗначениеЗаполнено(Параметры.ДатаВыброса) Тогда	
	// }EXTCODE 01.03.2016 17:00:52 Кузнецов Д.В., Исправил.	
		
	    ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("НачалоДействияРазрешения");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	    ЭлементОтбора.Использование    = Истина;
	    ЭлементОтбора.ПравоеЗначение   = Параметры.ДатаВыброса;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("КонецДействияРазрешения");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	    ЭлементОтбора.Использование    = Истина;
	    ЭлементОтбора.ПравоеЗначение   = Параметры.ДатаВыброса;
				
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти