#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// 1. У выпуска не может быть несколько одинаковых категорий качества воды.
	СтруктураПоиска = Новый Структура("КатегорияКачества");
	
	ТаблицаКатегорийКачества = Новый ТаблицаЗначений;
	
	ТаблицаКатегорийКачества.Колонки.Добавить("КатегорияКачества");
	ТаблицаКатегорийКачества.Колонки.Добавить("Количество");
	
	Для Каждого СтрокаКатКачества Из КатегорииКачестваВоды Цикл 
		
		СтрокаТабПроверки = ТаблицаКатегорийКачества.Добавить();
		
		СтрокаТабПроверки.КатегорияКачества = СтрокаКатКачества.КатегорияКачества;
		СтрокаТабПроверки.Количество        = 1;
		
	КонецЦикла; // Для Каждого СтрокаКатКачества Из КатегорииКачестваВоды Цикл 
	
	ТаблицаКатегорийКачества.Свернуть("КатегорияКачества", "Количество");
	
	Ошибки = Неопределено;
	
	Для Каждого СтрокаТабПроверки Из ТаблицаКатегорийКачества Цикл 
		
		Если СтрокаТабПроверки.Количество > 1 Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В таблице категорий качества вод, категория <" + СтрокаТабПроверки.КатегорияКачества + 
			"> указана несколько раз. Указание одной категории качества несколько раз недопустимо.", ЭтотОбъект, "КатегорииКачестваВоды", , Отказ); 
			
		КонецЕсли; // Если СтрокаТабПроверки.Количество > 1 Тогда
		
	КонецЦикла; // Для Каждого СтрокаТабПроверки Из ТаблицаКатегорийКачества Цикл 
	
	СписокВидовВодныхОбъектовУстье = Справочники.Водозаборы.ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья();
	
	Если СписокВидовВодныхОбъектовУстье.Найти(КодТипаИсточникаПриемника) <> Неопределено Тогда 
		ПроверяемыеРеквизиты.Добавить("РасстояниеОтУстья");
	КонецЕсли; // Если СписокВидовВодныхОбъектовУстье.Найти(КодТипаИсточникаВодоснабжения) <> Неопределено Тогда

	
КонецПроцедуры // Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

Процедура ПриЗаписи( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 11:15
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 11:15 Конец

	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Обработки.СозданиеНСИ.ЗапуститьБизнесПроцессСогласования( Ссылка );
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 11:15
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 11:15 Конец

	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Если Не Обработки.СозданиеНСИ.ЭлементДоступенДляРедактирования( Ссылка ) Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
