Функция ПечатьЖурналОпределенияКомпонентовВВоде(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_ЖурналОпределенияКомпонентовВВоде_ЖурналОпределенияКомпонентовВВоде";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_ЖурналОпределенияКомпонентовВВоде.ПФ_MXL_ЖурналОпределенияКомпонентовВВоде");
		
	Для каждого ТекущийОбъект из МассивОбъектов Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка
		Область = Макет.ПолучитьОбласть("ОбластьШапка");
		ТабличныйДокумент.Вывести(Область);
		
		НЗ = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВВоде.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(ТекущийОбъект);
		НЗ.Прочитать();
		
		
		// Строки
		Для каждого Проба из НЗ Цикл
			
			Область = Макет.ПолучитьОбласть("ОбластьСтрока");
			Область.Параметры.Заполнить(Проба);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	    // Подвал
		Область = Макет.ПолучитьОбласть("ОбластьПодвал");
		Область.Параметры.Ответственный = ТекущийОбъект.Ответственный;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции	

// Формирует печатные формы
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВВоде") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВВоде", "Журнал определения компонентов в воде",
			ПечатьЖурналОпределенияКомпонентовВВоде(МассивОбъектов, ОбъектыПечати),, "Документ.лис_ЖурналОпределенияКомпонентовВВоде.ПФ_MXL_ЖурналОпределенияКомпонентовВВоде");
			
	КонецЕсли; 
	
КонецПроцедуры
