
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФорму()
	
	Если Не ЗначениеЗаполнено(Объект.РазделУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.АтмосферныйВоздух")  Тогда
		МассивТиповАтмосфера = Новый Массив;
		МассивТиповАтмосфера.Добавить(Тип("СправочникСсылка.СанитарноЗащитныеЗоны"));
		МассивТиповАтмосфера.Добавить(Тип("СправочникСсылка.СелитебныеЗоны"));
		
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповАтмосфера);
		Элементы.МестоОтбораПроб.ВыбиратьТип 	 = Истина;
		
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПроизводственныеПлощадки");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЗВАтмосфера");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	 = Ложь;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
		Элементы.МестоОтбораПроб.Видимость = Истина; 
		
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ПромышленныеВыбросы")  Тогда
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИсточникиЗагрязнения");
		Элементы.МестоОтбораПроб.ВыбиратьТип 	   = Ложь;
		
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЗВАтмосфера");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Ложь;
		
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.СточныеВоды")  Тогда
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВыпускиВВоду");
		Элементы.МестоОтбораПроб.ВыбиратьТип 	   = Ложь;
		
		МассивТиповЗВПриродныеВоды = Новый Массив;
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.ЗВВода"));
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.КонтролируемыеПоказателиВВоде"));
	
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповЗВПриродныеВоды);
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Истина;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;		
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ПриродныеВоды")  Тогда
		МассивТиповПриродныеВоды = Новый Массив;
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.Скважины"));
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.ВыпускиВВоду"));
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.ВодныеОбъекты"));
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.Водозаборы"));
		
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповПриродныеВоды);
		Элементы.МестоОтбораПроб.ВыбиратьТип 	   = Истина;
		
		МассивТиповЗВПриродныеВоды = Новый Массив;
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.ЗВВода"));
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.КонтролируемыеПоказателиВВоде"));
	
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповЗВПриродныеВоды);
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Истина;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы")  Тогда
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КонтролируемыеПараметрыВПочвеДонныхОтложениях");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПроизводственныеПлощадки");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения")  Тогда
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВодныеОбъекты");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КонтролируемыеПараметрыВПочвеДонныхОтложениях");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.МестоОтбораПроб.Видимость = Ложь;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ФизическиеФакторы")  Тогда
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФакторыФизическогоВоздействия");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПроизводственныеПлощадки");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.АтмосферныеОсадки")  Тогда
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВеществаИПараметрыВАтмосферныхОсадках");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПослеЗакрытияПодбораПроб(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда	
		
		ПланОтбораПроб = Результат.ПланОтбораПроб;
		ИндексПробы = Результат.ИндексПробы;
		
		Объект.Организация = ПланОтбораПроб.Лаборатория.Владелец;
		Объект.Лаборатория = ПланОтбораПроб.Лаборатория;
		Объект.ДокументПлана = ПланОтбораПроб;
		Объект.ДатаОтбора = ПланОтбораПроб.ПериодС;
		Объект.ОбъектКонтроля = ПланОтбораПроб.Основное[ИндексПробы].ТочкаКонтроля.ОбъектКонтроля;
		Объект.Заказчик = ПланОтбораПроб.Основное[ИндексПробы].Организация;
		Объект.КоличествоПроб = ПланОтбораПроб.Основное[ИндексПробы].КоличествоЗамеров;
		Объект.ОбъектОтбораПроб = ПланОтбораПроб.Основное[ИндексПробы].ОбъектЗагрязнения;
		Объект.ЗаданиеВыдал = ПланОтбораПроб.ОтветственныйСотрудник;
		Объект.ЗаданиеПолучил = ПланОтбораПроб.Основное[ИндексПробы].СотрудникПроводящийЗамер;
		Объект.ОтобралПробу = ПланОтбораПроб.Основное[ИндексПробы].СотрудникПроводящийЗамер;
		Объект.РазделУчета = ПланОтбораПроб.ВидГрафика;
		
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", ПланОтбораПроб.Основное[ИндексПробы].КлючСтроки);
		НайденныеСтроки = ПланОтбораПроб.ЗагрязняющиеВещества.НайтиСтроки(Отбор);
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			НС = Объект.Пробы.Добавить();
			НС.ТочкаОтбораПробы = ПланОтбораПроб.Основное[ИндексПробы].ТочкаКонтроля;
			НС.ОпределяемыйПоказатель = НайденнаяСтрока.ЗагрязняющееВещество;
		КонецЦикла;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НС = Объект.Пробы.Добавить();
			НС.ТочкаОтбораПробы = ПланОтбораПроб.Основное[ИндексПробы].ТочкаКонтроля;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделУчетаПриИзменении(Элемент)
	
	Объект.ОбъектКонтроля = Неопределено;
	
	Объект.ОбъектОтбораПроб = Неопределено;
	
	Объект.Пробы.Очистить();
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПланаОтбораПроб(Команда)

	ПараметрыПодбораПроб = новый Структура;
	ПараметрыПодбораПроб.Вставить("ПланОтбораПроб", Объект.ДокументПлана);
	
	ВыполнитьПослеЗакрытияПодбораПроб = новый ОписаниеОповещения("ВыполнитьПослеЗакрытияПодбораПроб", ЭтотОбъект);
	
	ОткрытьФорму("Документ.лис_АктОтбораПроб.Форма.ФормаПодбораПроб", ПараметрыПодбораПроб, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно, , ВыполнитьПослеЗакрытияПодбораПроб, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти
