#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыпуститьПротоколНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколКонтроляКачестваАтмосферногоВоздуха.Ссылка
	               |ИЗ
	               |	Документ.ПротоколКонтроляКачестваАтмосферногоВоздуха КАК ПротоколКонтроляКачестваАтмосферногоВоздуха
	               |ГДЕ
	               |	ПротоколКонтроляКачестваАтмосферногоВоздуха.лис_АктОтбора = &Акт
	               |	И ПротоколКонтроляКачестваАтмосферногоВоздуха.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Акт", АктОтбора);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		
		Протокол = Документы.ПротоколКонтроляКачестваАтмосферногоВоздуха.СоздатьДокумент();
		Протокол.Дата = ТекущаяДата();
		Протокол.Организация = Документ.Организация;
		Протокол.ДатаПротокола = ТекущаяДата();
		Протокол.лис_АктОтбора = АктОтбора;
		Протокол.Ответственный = Документ.Ответственный;
			
		НаборЗаписей = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.АктОтбора.Установить(АктОтбора);
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		НаборЗаписей.Прочитать();
		
		Для Каждого Строка Из НаборЗаписей Цикл
			НоваяСтрокаЗамеры = Протокол.Замеры.Добавить();
			НоваяСтрокаЗамеры.ОбъектКонтроля = АктОтбора.ОбъектКонтроля;
			НоваяСтрокаЗамеры.ОбъектОтбораПроб = АктОтбора.ОбъектОтбораПроб;
			НоваяСтрокаЗамеры.ТочкаКонтроля = Строка.ТочкаОтбораПробы;
			НоваяСтрокаЗамеры.Температура = АктОтбора.ТемператураВоздухаВМестеОтбора;
			НоваяСтрокаЗамеры.Ключ = Строка(Новый УникальныйИдентификатор);
		
			НоваяСтрока = Протокол.РезультатыЗамеров.Добавить();
			НоваяСтрока.ЗагрязняющееВещество = Строка.ОпределяемыйПоказатель;
			НоваяСтрока.Концентрация = Строка.СодержаниеПоРасчету;
	 		НоваяСтрока.Ключ = НоваяСтрокаЗамеры.Ключ;
		КонецЦикла;
		
		Протокол.Записать();
		
		Возврат Протокол.Ссылка;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	АктОтбора = Параметры.АктОтбора;

	Основное.Отбор.Элементы.Очистить(); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "Документ", Документ, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "АктОтбора", АктОтбора, ВидСравненияКомпоновкиДанных.Равно,,Истина);

КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпуститьПротокол(Команда)
	
	Протокол = ВыпуститьПротоколНаСервере();
	ОповеститьОбИзменении(Протокол);

	ПараметрыФормы = Новый Структура("Ключ", Протокол);
	
	ОткрытьФорму("Документ.ПротоколКонтроляКачестваАтмосферногоВоздуха.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

#КонецОбласти
