#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РасчитатьСреднееЗначение()
	
	Запись.СреднееЗначение = (Запись.ПоказаниеПрибора1 + Запись.ПоказаниеПрибора2 + Запись.ПоказаниеПрибора3 + Запись.ПоказаниеПрибора4 + Запись.ПоказаниеПрибора5) / 5;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	

КонецПроцедуры


&НаКлиенте
Процедура ОбъемПробыПриИзменении(Элемент)

	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора1ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора2ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора3ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора4ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора5ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

#КонецОбласти

