
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// На основании предопределенных данных создает элементы в ИБ
// 
Процедура СоздатьЭлементыПредопределеныхЗначений() Экспорт 
	
	НачатьТранзакцию();
	
	ВидНормативногоДокументаИСО = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыНормативныхДокументов.ИСО");
	
	Если ВидНормативногоДокументаИСО = Неопределено Тогда 
		
		НормативныйДокументИСО = Справочники.ВидыНормативныхДокументов.СоздатьЭлемент();
		
		НормативныйДокументИСО.Наименование = "ISO 14001";
		НормативныйДокументИСО.ИмяПредопределенныхДанных = "ИСО";
		НормативныйДокументИСО.Записать();
				
	КонецЕсли; // Если ВидНормативногоДокументаИСО = Неопределено Тогда  	
		
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П41");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.1. Общие требования (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное  = "П. 4.1. Общие требования (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");
		
		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П41";
		
		НовЭлемент.Записать();

		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, документально оформить, внедрить, поддерживать и
		|последовательно улучшать систему экологического менеджмента в соответствии с требованиями
		|настоящего международного стандарта и определить, как будут выполняться эти требования.
		|Организация должна определить и документально оформить границы своей системы экологического
	    |менеджмента";
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П42");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.2 Экологическая политика (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.2 Экологическая политика (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П42";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Высшее руководство должно определить экологическую политику организации и обеспечить, чтобы в
		|установленных границах системы экологического менеджмента эта политика:
		|а) соответствовала характеру, масштабу и воздействиям на окружающую среду ее деятельности,
		|продукции или услуг;
		|б) включила обязательство в отношении последовательного улучшения и предотвращения
		|загрязнения;
		|в) включала обязательство в отношении соответствия применимым к организации требованиям
		|законодательства и другим требованиям, с которыми она согласилась и которые относятся к
		|экологическим аспектам ее деятельности;
		|г) предусматривала основу для установления и пересмотра экологических целей и задач;
		|д) была документально оформлена, внедрена и поддерживалась в актуальном состоянии;
		|е) доводилась до сведения всех лиц, которые работают для организации, или от ее имени;
		|ж) была доступна для общественности.";
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П431");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.3.1 Экологические аспекты (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.3.1 Экологические аспекты (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П431";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы)
		|а) идентификации экологических аспектов своей деятельности, продукции и услуг в рамках
		|установленных границ системы экологического менеджмента, которые она может контролировать и
		|на которые она предположительно может оказывать влияние, с учетом планируемых или новых
		|разработок, новых или измененных видов деятельности, продукции и услуг, и
		|б) определения тех аспектов, которые оказывают или могут оказывать значительные воздействия на
		|окружающую среду (т.е. значимых экологических аспектов).
		|Организация должна документально оформлять эту информацию и поддерживать ее в актуальном
		|состоянии.
		|Организация должна гарантировать, что значимые экологические аспекты принимаются во внимание при
		|внедрении и функционировании ее системы экологического менеджмента.";
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П432");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.3.2 Законодательные и другие требования (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.3.2 Законодательные и другие требования (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П432";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы)
		|а) идентификации и получения доступа к законодательным и другим требованиям, которые она
		|самостоятельно обязалась выполнять и которые относятся к экологическим аспектам организации, и
		|б) определения, как эти требования применяются к ее экологическим аспектам.
		|Организация должна гарантировать, что эти применимые законодательные и прочие требования
		|принимаются во внимание при внедрении и функционировании ее системы экологического
		|менеджмента.";
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
			
	КонецЕсли; // Если Элемент = Неопределено Тогда

	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П433");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.3.3 Цели, задачи и программа(ы) (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.3.3 Цели, задачи и программа(ы) (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П433";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, выполнять и поддерживать в рабочем состоянии документально
		|оформленные экологические цели и задачи для каждого соответствующего подразделения и уровня в
		|рамках этой организации.
		|Цели и задачи должны быть измеримы, там где это возможно, и должны быть согласованы с
		|экологической политикой, включая обязательство по предотвращению загрязнения, обязательство
		|соответствию применимым законодательным и прочим требованиям, обязательство по
		|последовательному улучшению.
		|При установлении и пересмотре своих экологических целей и задач организация должна учитывать
		|законодательные и другие требования, а также свои значимые экологические аспекты. Необходимо
		|также принимать во внимание технологические возможности организации, а также финансовые,
		|эксплуатационные требования и требования деловых кругов, точку зрения заинтересованных сторон.
		|Организация должна разработать, выполнять и поддерживать в рабочем состоянии программу(ы)
		|достижения ее целей и задач. Программа должна включать:
		|а) распределение ответственности за достижение экологических целей и задач для каждого
		|соответствующего подразделения и уровня в рамках организации;
		|б) средства и сроки, в которые они должны быть достигнуты";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда

	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П441");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.1 Ресурсы, функциональные обязанности, ответственность и полномочия (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.1 Ресурсы, функциональные обязанности, ответственность и полномочия (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П441";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Руководство организации должно предоставить ресурсы, необходимые для внедрения,
		|функционирования и улучшения системы экологического менеджмента. Ресурсы включают в себя
		|людские ресурсы, специальные знания и опыт, инфраструктуру организации, технологию и финансовые
		|ресурсы.
		|Обязанности, ответственность и полномочия должны быть определены, документально оформлены и
		|доведены для содействия эффективному экологическому менеджменту.
		|Высшее руководство организации должно назначать своего специального представителя (одного или
		|нескольких), который независимо от других обязанностей должен иметь определенные обязанности,
		|ответственность и полномочия для:
		|а) обеспечения выполнения требований системы экологического менеджмента в соответствии с
		|настоящим международным стандартом;
		|б) предоставления отчетов о функционировании системы экологического менеджмента, включая
		|рекомендации по улучшению, для анализа высшему руководству.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П442");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.2 Компетентность, подготовка и осведомленность (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.2 Компетентность, подготовка и осведомленность (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");
		
		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П442";

		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна обеспечить, что персонал, выполняющий работы, которые могут оказать
		|значительное воздействие на окружающую среду, должен обладать компетентностью, обусловленной
		|соответствующим образованием, подготовкой и/или практическим опытом и должен хранить
		|соответствующие записи.
		|Организация должна определять потребности в обучении персонала, связанные с ее экологическими
		|аспектами и системой экологического менеджмента. Организация должна проводить обучение или
		|предпринимать другие действия, чтобы удовлетворить потребность в обучении, а также должна хранить
		|соответствующие записи.
		|Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы),
		|позволяющую персоналу организации или сотрудникам, работающим от ее имени, понимать:
		|а) важность соответствия экологической политике, процедурам и требованиям системы экологического
		|менеджмента,
		|б) значимые экологические аспекты и связанные с ними действительные или потенциальные
		|воздействия на окружающую среду, пользу для окружающей среды от повышения эффективности
		|работы каждого сотрудника,
		|в) свои обязанности, и ответственность в достижении соответствия требованиям системы
		|экологического менеджмента, и
		|г) потенциальные последствия отступлений от установленных процедур.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П443");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.3 Обмен информацией (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.3 Обмен информацией (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П443";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"По отношению к своим экологическим аспектам и системе экологического менеджмента организация
		|должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы):
		|а) обмена информацией внутри организации между ее различными уровнями и подразделениями;
		|б) получения, документального оформления и ответа на соответствующую информацию или запросы
		|от внешних заинтересованных сторон.
		|Организация должна принять решение о необходимости сообщения внешним сторонам об экологических
		|аспектах ее деятельности и должна документально оформить свое решение. В случае, если такое
		|решение принято, организация должна разработать и применять методы для таких внешних
		|взаимодействий.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда

	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П444");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.4 Документация (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.4 Документация (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П444";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Документация системы экологического менеджмента должна включать:
		|а) экологическую политику, цели и задачи,
		|б) описание границ системы экологического менеджмента,
		|в) описание основных элементов системы экологического менеджмента и их взаимодействия, а также
		|ссылки на связанные с этим документы,
		|г) документы, включая записи, требуемые настоящим международным стандартом, и
		|д) документы, включая записи, определенные организацией как необходимые для обеспечения
		|эффективного планирования, функционирования и контроля над процессами, которые связаны с ее
		|значимыми экологическими аспектами.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
	
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П445");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.5 Управление документацией (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.5 Управление документацией (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П445";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Документы, требуемые системой экологического менеджмента и настоящим международным
		|стандартом должны контролироваться. Записи являются особым типом документов и должны
		|контролироваться в соответствии с требованиями, приведенными в пункте 4.5.4.
		|Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы) с тем,
		|чтобы:
		|а) документы утверждались на предмет их адекватности до их распространения,
		|б) пересматривались и обновлялись по мере необходимости, утверждались заново,
		|в) обеспечить, что изменения и текущий статус изменения документа определены,
		|г) обеспечить, чтобы текущие версии соответствующих документов были доступны в местах их
		|использования,
		|д) обеспечить, чтобы документы были понятными и легко идентифицируемыми,
		|е) обеспечить, чтобы документы внешнего происхождения, рассматриваемые организацией как важные
		|для планирования и функционирования системы экологического менеджмента, были определены, и
		|их распространение контролировалось, и
		|ж) предотвращать непреднамеренное использование устаревших документов и использовать по
		|отношению к ним соответствующее обозначение, если они хранятся для каких либо целей.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда

	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П446");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.6 Управление операциями (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.6 Управление операциями (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П446";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна идентифицировать и планировать операции, которые связаны с
		|идентифицированными значимыми экологическими аспектами, в соответствии с ее экологической
		|политикой, целями и задачами для обеспечения того, чтобы они выполнялись в заданных условиях
		|посредством:
		|а) разработки, выполнения и поддержания документированной процедуры для ситуаций, когда
		|отсутствие процедур может привести к отступлениям от экологической политики, целей и задач, и
		|б) отражения в процедурах критериев деятельности;
		|в) разработки, выполнения и поддержания процедур, связанных с идентифицированными значимыми
		|экологическими аспектами товаров и услуг, используемых организацией, и доведения до
		|поставщиков, включая подрядчиков, соответствующих процедур и требований.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П447");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.4.7 Готовность к нештатным ситуациям, авариям и ответные действия (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.4.7 Готовность к нештатным ситуациям, авариям и ответные действия (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П447";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы)
		|определения и реагирования в отношении возможных аварийных ситуаций и аварий, которые могут
		|оказывать воздействие на окружающую среду.
		|Организация должна реагировать на реальные аварии и аварийные ситуации и предотвращать или
		|снижать связанные с ними неблагоприятные экологические воздействия.
		|Организация должна периодически анализировать, и, в случае необходимости пересматривать свои
		|процедуры подготовленности к аварийным ситуациям и реагирования на них, особенно после
		|возникновения аварий или аварийных ситуаций.
		|Организация также должна периодически проверять на практике такие процедуры, там, где это
		|возможно.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П451");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.5.1 Мониторинг и измерение (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.5.1 Мониторинг и измерение (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П451";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы)
		|регулярного мониторинга и измерения основных характеристик своих операций, которые могут
		|существенно воздействовать на окружающую среду. Процедура(ы) должна включать документальное
		|оформление информации для мониторинга результатов деятельности, соответствующий операционный
		|контроль и соответствие экологическим целям и задачам организации.
		|Организация должна обеспечить, чтобы оборудование, используемое для осуществления мониторинга и
		|измерений, прошло калибровку и поверку и поддерживалось в рабочем состоянии, а соответствующие
		|записи хранились.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П452");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.5.2 Оценка соответствия (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.5.2 Оценка соответствия (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П452";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"4.5.2.1 Придерживаясь своего обязательства о соответствии, организация должна разработать,
		|выполнять и поддерживать в рабочем состоянии процедуру(ы) периодической оценки соответствия
		|применимым к ней законодательным требованиям.
		|Организация должна хранить записи результатов периодических оценок.
		|4.5.2.2 Организация должна оценивать соответствие другим требованиям, с которыми она согласилась.
		|Организация может объединить эту оценку с оценкой соответствия законодательству, как указано в
		|4.5.2.1 или разработать для этого отдельную процедуру.
		|Организация должна хранить записи результатов периодических оценок.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда

	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П453");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.5.3 Несоответствия, корректирующие и предупреждающие действия (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.5.3 Несоответствия, корректирующие и предупреждающие действия (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П453";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы) по
		|выявлению текущих и потенциальных несоответствий и принятия корректирующих и предупреждающих
		|действий. Процедура должна определять требования по:
		|а) определению и исправлению несоответствий и принятию мер по смягчению их неблагоприятных
		|экологических последствий,
		|б) изучению несоответствий, определению их причин и принятию необходимых мер для того, чтобы
		|избежать их появления,
		|в) оценка необходимости осуществления действий по предотвращению несоответствий и выполнение
		|необходимых действий чтобы избежать их появления,
		|г) документирование результатов предпринятых корректирующих и предупреждающих действий, и
		|д) анализ эффективности предпринятых корректирующих и предупреждающих действий.
		|Предпринятые действия должны соответствовать важности проблем и выявленному воздействию на
		|окружающую среду.
		|Организация должна обеспечить, что все необходимые изменения внесены в документацию системы
		|экологического менеджмента.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П454");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.5.4 Управление записями (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.5.4 Управление записями (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");
		
		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П454";

		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна разработать и поддерживать в рабочем состоянии записи, необходимые для
		|демонстрации соответствия требованиям ее системы экологического менеджмента и данному
		|международному стандарту, а также записи по достигнутым результатам.
		|Организация должна разработать, выполнять и поддерживать в рабочем состоянии процедуру(ы) по
		|идентификации, хранению, обеспечению сохранности, поиску, ведению и удалению записей.
		|Записи должны быть разборчивы, идентифицируемы и прослеживаемы.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П455");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.5.5 Внутренний аудит (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.5.5 Внутренний аудит (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П455";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Организация должна обеспечить, что внутренние аудиты системы экологического менеджмента
		|проводились в запланированное время, с тем, чтобы:
		|а) определить:
		|1) соответствует или нет система экологического менеджмента запланированным мероприятиям по
		|экологическому менеджменту, в том числе требованиям настоящего стандарта, и
		|2) внедрена и функционирует ли должным образом система экологического менеджмента, а также
		|б) предоставить информацию о результатах аудита руководству.
		|Программа(ы) аудита должна планироваться, разрабатываться, выполняться и поддерживаться
		|организацией, с учетом экологической важности различных видов ее деятельности и результатов
		|предыдущих аудитов.
		|Процедура(ы) аудита должна быть разработана, выполняться и поддерживаться в рабочем состоянии, а
		|также включать:
		|распределение
		|ответственности и требования для планирования и проведения аудитов, сообщать
		|результаты и хранение связанных с этим записей,
		|определение
		|критериев аудита, границ, периодичности и методов.
		|Подбор аудиторов и проведение аудитов должно обеспечивать объективность и беспристрастность
		|процесса аудита.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();
		
	КонецЕсли; // Если Элемент = Неопределено Тогда
	
	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования.ИСО_П46");
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = "П. 4.6 Анализ со стороны руководства (ИСО 14001)";	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = "П. 4.6 Анализ со стороны руководства (ИСО 14001)";
		НовЭлемент.ДатаВступленияВСилу = Дата("20041115");
		НовЭлемент.ДатаУтверждения     = Дата("20041115");

		НовЭлемент.ИмяПредопределенныхДанных = "ИСО_П46";
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Записывать = Истина;
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Дата("20041115"));
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Дата("20041115");
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = 
		"Высшее руководство организации должно анализировать систему экологического менеджмента через
		|установленные промежутки времени, с тем, чтобы обеспечить на постоянной основе ее надлежащую
		|работу, адекватность и эффективность. Анализы должны включать оценку возможностей для улучшения
		|и необходимости внесения изменений в систему экологического менеджмента, включая экологическую
		|политику, экологические цели и задачи. Записи по анализу руководства должны храниться.
		|Входные данные для анализа руководства должны включать:
		|а) результаты внутренних аудитов и оценку соответствия законодательным и другим требованиям, с
		|которыми организация согласилась,
		|б) данные о взаимодействии с внешними заинтересованными сторонами, включая жалобы,
		|в) результаты экологической деятельности организации,
		|г) степень достижения экологических целей и задач,
		|д) статус корректирующих и предупреждающих действий,
		|е) данные о выполненных действиях с момента прошлого анализа руководства,
		|ж) изменившиеся обстоятельства, включая изменения требований экологического законодательства и
		|других требований, связанных с экологическими аспектами деятельности организации,
		|з) рекомендации по улучшению.
		|Выходные данные анализа со стороны руководства должны включать любые решения и действия,
		|связанные с возможными изменениями экологической политики, целей, задач и других элементов
		|системы экологического менеджмента, согласующиеся с обязательством по последовательному
		|улучшению.";		
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда

	// {EXTCODE 28.08.2017 Ушаков А.Е.
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П41_2017", "П. 4.1. Понимание организации и ее среды (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна определять внешние и внутренние факторы, которые существенны с точки зрения ее целей и которые влияют на способность 
	|ее системы экологического менеджмента достигать ожидаемого результатов. Такие факторы должны включать в себя экологические условия, 
	|на которые влияет или может влиять организация.");
	
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П42_2017", "П. 4.2  Понимание потребностей и ожиданий заинтересованных сторон (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна установить:
	|a) заинтересованные стороны, значимые в рамках системы экологического менеджмента;
	|b) существенные потребности и ожидания (т.е. требования) этих заинтересованных сторон;
	|c) какие из этих потребностей и ожиданий будут ее обязательствами соблюдения.");
	
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П43_2017", "П. 4.3 Определение области применения системы экологического менеджмента (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна определить границы и применимость системы экологического менеджмента с тем, чтобы
	|установить ее область действия.
	|Определяя эту область, организация должна принять во внимание:
	|a) внешние и внутренние факторы, указанные в 4.1;
	|b) обязательные требования, указанные в 4.2;
	|c) структурные подразделения, функции и физические границы;
	|d) свою деятельность, продукты и услуги;
	|e) свои полномочия и способность осуществлять контроль и воздействие.
	|После того, как область действия определена, вся деятельность, все продукты и услуги организации,
	|включенные в эту область, должны быть включены и в систему экологического менеджмента.
	|Область действия должна быть оформлена и управляться как документированная информация и быть доступна
	|заинтересованным сторонам.");
	
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П44_2017", "П. 4.4 Система экологического менеджмента (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Для достижения запланированных результатов, включая улучшение показателей экологической деятельности,
	|организация должна установить, внедрить, поддерживать в рабочем состоянии и постоянно улучшать систему
	|экологического менеджмента, включая необходимые процессы и их взаимодействия, в соответствии с
	|требованиями настоящего Международного Стандарта.
	|Организация при разработке и поддержании системы экологического менеджмента должна принимать во
	|внимание данные, указанные в 4.1 и 4.2.");
	
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П51_2017", "П. 5.1 Лидерство и приверженность (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"5.1.1 Общие положения
	|Высшее руководство должно демонстрировать лидерство и заинтересованность в отношении системы экологического менеджмента посредством:
	|a) принятия ответственности за результативность системы экологического менеджмента;
	|b) гарантии того, что экологическая политика и экологические цели установлены и согласованы состратегическим направлением развития и контекстом организации;
	|c) гарантии того, что требования системы экологического менеджмента встроены в бизнес-процессы организации;
	|d) гарантии того, что ресурсы, необходимые для системы экологического менеджмента, доступны;
	|e) донесения важности результативного экологического менеджмента и выполнения требований системы экологического менеджмента;
	|f) гарантии того, что система экологического менеджмента достигает ожидаемых результатов;
	|g) нацеливания и поддержания усилий персонала на обеспечение результативности системы экологического менеджмента;
	|h) поощрения постоянного улучшения;
	|i) поощрения демонстрации лидерства на важных управленческих позициях в границах установленной ответственности.
	|ПРИМЕЧАНИЕ Термин ""бизнес"" в настоящем Международном Стандарте может интерпретироваться широко, обозначая ту деятельность, которая является основной с точки зрения целей существования организации.");
	
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П52_2017", "П. 5.2 Экологическая политика (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Высшее руководство должно установить, ввести в действие и поддерживать в актуальном состоянии экологическую политику, которая в рамках определенной области действия системы экологического менеджмента:
	|a) соответствует целям и контексту организации, включая характер, масштаб и влияние на окружающую среду ее деятельности, продуктов и услуг;
	|b) обеспечивает основу для постановки экологических целей;
	|c) включает обязательство защищать окружающую среду, включая предотвращение загрязнений и иные конкретные обязательства, существенные с точки зрения контекста организации; ПРИМЕЧАНИЕ Иные конкретные обязательства по защите окружающей среды могут включать в себя рациональное использование ресурсов, смягчение последствий изменения климата и адаптацию к ним, а также защиту биологического разнообразия и экосистем.
	|d) включает готовность выполнять ее обязательные требования;
	|e) включает обязательство постоянно улучшать систему экологического менеджмента с целью повышения показателей экологической деятельности.
	|Экологическая политика должна:
	|- быть оформлена как документированная информация;
	|- быть доведена до сведения сотрудников организации;
	|- быть доступна заинтересованным сторонам.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П53_2017", "П. 5.2 Функции, ответственность и полномочия (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Высшее руководство должно гарантировать, что ответственность и полномочия для соответствующих ролей установлены и доведены до сотрудников организации.
	|Высшее руководство должно установить ответственность и полномочия для:
	|a) обеспечения соответствия системы экологического менеджмента требованиям настоящего Международного Стандарта;
	|b) отчетности высшему руководству о функционировании системы экологического менеджмента, включая показатели экологической деятельности;");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П611_2017", "П. 6.1.1 Общие положения (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна определить, внедрить и выполнять процессы, необходимые для соответствия требованиям, установленным в 6.1.1 – 6.1.4.
	|При планировании системы экологического менеджмента организация должна принять во внимание:
	|- факторы, указанные в 4.1;
	|- требования, установленные в 4.2;
	|- область действия системы экологического менеджмента;
	|а также определить риски и возможности, связанные с ее экологическими аспектами (см. 6.1.2), обязательствами соблюдения (см. 6.1.3) и другими факторами и требованиями, указанными в 4.1 и 4.2, которые должны быть учтены, чтобы:
	|- дать гарантии того, что система экологического менеджмента может достигать своих запланированных результатов;
	|- исключить или уменьшить нежелательные последствия, включая возможность влияния внешних экологических условий на организацию;
	|- достигать постоянного улучшения.
	|В рамках области действия системы экологического менеджмента организация должна определять возможные чрезвычайные ситуации, включая те, которые могут иметь экологическое воздействие.
	|Организация должна управлять документированной информацией, связанной с:
	|- рисками и возможностями, которые должны быть учтены;
	|- процессами, необходимыми в силу требований п.п. 6.1.1 – 6.1.4 в объеме, необходимом для создания уверенности, что они выполняются, как запланировано.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П612_2017", "П. 6.1.2 Экологические аспекты (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"В рамках установленной области действия системы экологического менеджмента организация должна определить экологические аспекты своей деятельности, продуктов и услуг, которые она может контролировать и те, на которые она может влиять, а также связанные с ними экологические воздействия с учетом концепции жизненного цикла.
	|При определении экологических аспектов организация должна принять во внимание:
	|a) изменения, включая запланированные или новые разработки, а также новые или измененные виды деятельности, продукты и услуги;
	|b) нарушение нормальных условий и прогнозируемые в разумных пределах чрезвычайные ситуации.
	|Организация должна определить, применяя установленные критерии, такие аспекты, которые имеют или могут иметь существенное экологическое воздействие, т.е. существенные экологические аспекты.
	|Организация должна эти существенные экологические аспекты довести до сведения на различных уровнях и до различных функциональных единиц организации, в той мере, насколько это применимо.
	|Организация должна управлять документированной информацией по:
	|- экологическим аспектам и связанным с ними экологическим воздействиям;
	|- критериям, применяемым для определения существенных экологических аспектов;
	|- существенным экологическим аспектам.
	|ПРИМЕЧАНИЕ Существенные экологические аспекты могут выражаться в рисках и возможностях, связанных либо с негативными воздействиями (угрозами), либо благоприятными экологическими воздействиями (перспективами).");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П613_2017", "П. 6.1.3 Принятые обязательства (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна:
	|a) определить и иметь доступ к обязательствам соблюдения, связанным с ее экологическими аспектами;
	|b) определить, каким образом обязательные требования применимы к организации;
	|c) учитывать эти обязательные требования при разработке, внедрении, функционировании и постоянном улучшении ее системы экологического менеджмента.
	|Организация должна управлять документированной информацией, связанной с обязательствами соблюдения.
	|ПРИМЕЧАНИЕ Обязательные требования могут вести к рискам и возможностям для организации.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П614_2017", "П. 6.1.4 Планирование действий (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна планировать:
	|a) выполнение мероприятий в отношении:
	|1) существенных экологических аспектов;
	|2) обязательных требований;
	|3) рисков и возможностей, указанных в 6.1.1;
	|b) каким образом:
	|1) встроить и выполнять эти мероприятия в рамках процессов системы экологического менеджмента (см. 6.2, раздел 7, раздел 8 и 9.1) или других бизнес-процессов;
	|2) оценивать результативность этих мероприятий (см. 9.1).
	|При планировании этих мероприятий организация должна принять во внимание свои технологические возможности, а также финансовые, технические и бизнес требования.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П621_2017", "П. 6.2.1 Экологические цели (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна установить экологические цели для значимых функций и уровней, принимая во внимание существенные экологические аспекты организации и связанные с ними обязательные требования, а также учитывая риски и возможности.
	|Экологические цели должны:
	|a) быть согласованы с экологической политикой;
	|b) быть измеримыми (если это практически осуществимо);
	|c) отслеживаться с точки зрения их выполнения;
	|d) быть доведены до сведения;
	|e) обновляться по необходимости.
	|Организация должна управлять документированной информацией по экологическим целям.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П622_2017", "П. 6.2.2 Планирование действий по достижению целей (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Планируя достижение целей в области качества, организация должна определить:
	|a) что будет сделано;
	|b) какие ресурсы потребуются;
	|c) кто будет ответственным;
	|d) когда цели будут достигнуты;
	|e) как результаты будут оцениваться, включая индикаторы для отслеживания движения к достижению ее измеримых экологических целей (см. 9.1.1).
	|Организация должна продумывать, каким образом мероприятия по достижению экологических целей могут быть встроены в бизнес-процессы организации.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П71_2017", "П. 7.1 Ресурсы (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна определять и обеспечивать ресурсами, необходимыми для разработки, внедрения, функционирования и постоянного улучшения системы экологического менеджмента.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П72_2017", "П. 7.2 Компетентность (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна:
	|a) определять необходимую компетентность лица (лиц), выполняющего под своим контролем работу, которая влияет на его показатели экологической деятельности и его способность выполнять обязательные требования;
	|b) гарантировать, что эти лица компетентны в силу соответствующего образования, подготовки или опыта;
	|c) определять потребности в обучении, связанные с ее экологическими аспектами и ее системой экологического менеджмента;
	|d) там, где это возможно, предпринимать меры для обеспечения необходимой компетентности и оценивать результативность предпринятых мер;
	|ПРИМЕЧАНИЕ Возможные действия могут включать, например, проведение обучения, наставничество или перемещение работающих сотрудников; или прием новых либо привлечение по контракту компетентных специалистов.
	|Организация должна сохранять соответствующую документированную информацию как свидетельства компетентности.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П73_2017", "П. 7.3 Осведомленность (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна гарантировать, что лица, выполняющие работы в рамках системы управления организации, информированы о:
	|a) экологической политике;
	|b) существенных экологических аспектах и связанных с ними имеющихся или возможных экологических воздействиях, связанных с их работой;
	|c) своем вкладе в результативность системы экологического менеджмента, включая выгоды от улучшения показателей экологической деятельности;
	|d) последствиях несоответствий требованиям системы экологического менеджмента, включая невыполнение обязательных требований, принятых организацией.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П74_2017", "П. 7.4 Обмен информацией (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"7.4.1 Общие положения
	|Организация должна определять, внедрять и поддерживать процесс(ы), необходимый(ые) для внутренних и внешних коммуникаций, существенных для системы экологического менеджмента, включая:
	|a) на какой предмет обмениваться информацией;
	|b) когда обмениваться информацией;
	|c) с кем обмениваться информацией;
	|d) как обмениваться информацией;
	|e) кто обменивается информацией.
	|При разработке своего(их) процесса(ов) коммуникации организация должна:
	|- учесть свои обязательные требования;
	|- гарантировать, что сообщаемая экологическая информация соответствует информации, полученной в рамках системы экологического менеджмента и является надежной.
	|Организация должна отвечать на соответствующие обращения в рамках системы экологического менеджмента.
	|Организация должна сохранять документированную информацию как свидетельство своих коммуникаций, насколько это применимо.
	|7.4.2 Внутренние коммуникации
	|Организация должна:
	|a) сообщать внутри себя информацию, значимую для системы экологического менеджмента, на разные уровни и функциональные единицы организации, включая информацию об изменения системы экологического менеджмента, насколько это применимо;
	|b) гарантировать, что ее процесс(ы) коммуникаций позволяет персоналу выполнять работу под управлением организации, нацеленную на постоянное улучшение.
	|7.4.3 Внешние коммуникации
	|Организация должна сообщать вовне информацию, значимую для системы экологического менеджмента, как это установлено процессом (процессами) коммуникации организации и как того требуют ее обязательные требования.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П75_2017", "П. 7.5 Документированная информация (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"7.5.1 Общие положения
	|Система экологического менеджмента организации должна включать:
	|a) документированную информацию, требуемую настоящим Международным стандартом;
	|b) документированную информацию, признанную организацией необходимой для обеспечения результативности системы экологического менеджмента.
	|ПРИМЕЧАНИЕ Объем документированной информации системы экологического менеджмента может отличаться в разных организациях в силу:
	|- размера организации и вида ее деятельности, процессов, продуктов и услуг;
	|- необходимости демонстрировать выполнение ее обязательных требований;
	|- сложности процессов и их взаимодействия;
	|- компетентности персонала, выполняющего работу под управлением организации.
	|7.5.2 Создание и обновление
	|Создавая и обновляя документированную информацию организация должна обеспечить соответствующие:
	|a) идентификацию и выходные данные (например, название, дата, автор или ссылочный номер),
	|b) формат (например, язык, версия программного обеспечения, графики) и носитель (например, бумага, электронный вид),
	|c) пересмотр и утверждение в целях сохранения пригодности и соответствия.
	|7.5.3 Управление документированной информацией
	|Документированной информацией, требуемой системой экологического менеджмента и настоящим Международным стандартом, необходимо управлять, чтобы гарантировать:
	|a) что она доступна и пригодна для применения там, где и когда она необходима;
	|b) что она надлежащим образом защищена (например, от потери конфиденциальности, неправильного применения или потери целостности).
	|Для управления документированной информацией организация должна осуществлять следующие действия, насколько это применимо:
	|- рассылать, обеспечивать доступ, выдачу и применение,
	|- хранить и сохранять в надлежащем состоянии, включая сохранение читаемости,
	|- контролировать изменения (например, контроль версий),
	|- устанавливать срок хранения и методы уничтожения.
	|Документированная информация внешнего происхождения, признанная организацией необходимой для планирования и функционирования системы экологического менеджмента, должна быть идентифицирована соответствующим образом и управляться.
	|ПРИМЕЧАНИЕ Термин «доступ» может подразумевать решение относительно разрешения только просматривать документированную информацию или разрешения и полномочий просматривать и изменять документированную информацию.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П81_2017", "П. 8.1 Планирование и управление деятельностью (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна определять, внедрять, управлять и обеспечивать процессы, необходимые для соответствия требованиям системы экологического менеджмента, а также выполнять действия, определенные в 6.1 и 6.2, посредством:
	|- установления операционных критериев для процесса(ов);
	|- управления процессом(ами) в соответствии с этими критериями.
	|ПРИМЕЧАНИЕ. Термин «управление» может включать технические средства управления и процедуры. Средства управления могут применяться, следуя иерархическому порядку (например, устранение, замена, административные методы), отдельно или в сочетании.
	|Организация должна управлять запланированными изменениями и анализировать последствия непреднамеренных изменений, принимая меры для снижения любого отрицательного эффекта, если необходимо.
	|Организация должна гарантировать, что переданный(ые) на сторону процесс(ы) выполняется (выполняются) в управляемых условиях или на него (них) можно влиять. Тип и объем контроля или влияния, которые должны быть применены к этому (этим) процессу(ам), должны определяться в рамках системы экологического менеджмента.
	|В соответствии с концепцией жизненного цикла организация должна:
	|a) определить средства управления, насколько это применимо, для гарантии того, что ее экологические требования учтены при проектировании и разработке процесса для производства продукта или услуги для каждой стадии жизненного цикла;
	|b) определить свои экологические требования к закупаемым продуктам и услугам, насколько это применимо;
	|c) сообщить свои существенные экологические требования внешним поставщикам, включая подрядчиков;
	|d) проанализировать потребность в получении информации о возможных существенных экологических воздействиях, связанных с транспортировкой или поставкой, применением, переработкой после утраты годности и окончательной утилизацией ее продуктов и услуг.
	|Организация должна управлять документированной информацией в объеме, необходимом для обеспечения уверенности, что эти процессы выполняется, как запланировано.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П82_2017", "П. 8.2 Готовность к аварийным и другим нештатным ситуациям и ответные действия (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна разработать, внедрить и обеспечивать процессы, необходимые для подготовки и реагирования на возможные чрезвычайные ситуации, определенные в 6.1.1.
	|Организация должна:
	|a) подготовиться к реагированию планированием мероприятий для предотвращения или снижения негативных экологических воздействий от чрезвычайных ситуаций;
	|b) реагировать на возникшие чрезвычайные ситуации;
	|c) предпринимать меры по предотвращению или снижению последствий чрезвычайных ситуаций, соответственно их масштабу и возможному экологическому воздействию;
	|d) периодически проводить проверку запланированных мероприятий по реагированию, если это практически осуществимо;
	|e) периодически анализировать и пересматривать процесс(ы) и запланированные мероприятия по реагированию, в особенности после того, как чрезвычайная ситуация произошла, или проведенной проверки;
	|f) сообщать заинтересованным сторонам, включая лиц, работающим под управлением организации, существенную информацию и проводить обучение, связанное с готовностью к чрезвычайным ситуациям и реагированием на них, насколько это применимо.
	|Организация должна управлять документированной информацией в объеме, необходимом для обеспечения уверенности, что процесс(ы) выполняется, как запланировано.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П91_2017", "П. 9.1 Мониторинг, измерения, анализ и оценка (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"9.1.1 Общие положения
	|Организация должна вести мониторинг, измерять, анализировать и оценивать показатели экологической деятельности.
	|Организация должна определять:
	|a) что требует мониторинга и измерений;
	|b) методы мониторинга, измерения, анализа и оценки, необходимые, насколько применимо, чтобы гарантировать пригодные результаты;
	|c) критерии, в сравнении с которыми организация будет оценивать свои показатели экологической деятельности, а также соответствующие индикаторы;
	|d) когда мониторинг и измерения должны выполняться;
	|e) когда результаты мониторинга и измерений должны быть проанализированы и оценены.
	|Организация должна гарантировать, что используется калиброванное и поверенное оборудование для мониторинга и измерений, насколько это применимо.
	|Организация должна оценивать свои показатели экологической деятельности и результативность системы экологического менеджмента.
	|Организация должна распространять существенную информацию о показателях экологической деятельности как внутри организации, так и вне ее, как это определено процессом (процессами) коммуникаций и как требуют ее обязательные требования.
	|Организация должна сохранять соответствующую документированную информацию как свидетельство результатов мониторинга, измерения, анализа и оценки.
	|9.1.2 Оценка соблюдения
	|Организация должна определить, внедрить и обеспечивать процессы, необходимые для оценки выполнения ее обязательных требований.
	|Организация должна:
	|a) определять частоту, с которой соблюдение будет оцениваться;
	|b) оценивать соблюдение и предпринимать меры, если необходимо;
	|c) обеспечивать знание и понимание своего состояния соблюдения.
	|Организация должна сохранять соответствующую документированную информацию как свидетельство результата(ов) оценки соблюдения.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П92_2017", "П. 9.2 Внутренний аудит (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"9.2.1 Общие положения
	|Организация должна проводить внутренние аудиты через запланированных интервалы времени, чтобы получать информацию о том, что система экологического менеджмента;
	|a) соответствует:
	|1) собственным требованиям организации к ее системе экологического менеджмента;
	|2) требованиям настоящего Международного стандарта;
	|b) результативно внедрена и функционирует.
	|9.2.2 Программа внутреннего аудита
	|Организация должна разрабатывать, выполнять и управлять программой (программами) аудита, включая периодичность их проведения, методы, ответственность, требования к планированию и отчетам о результатах внутренних аудитов.
	|При разработке программы внутреннего аудита организация должна принять во внимание важность с точки зрения экологии планируемых к аудиту процессов, изменений, влияющих на организацию и результаты предыдущих аудитов.
	|Организация должна:
	|a) определять критерии и область аудита для каждого аудита;
	|b) выбирать аудиторов и проводить аудиты так, чтобы гарантировать объективность и беспристрастность процесса аудита;
	|c) гарантировать, что результаты аудитов переданы соответствующим руководителям.
	|Организация должна сохранять документированную информацию как свидетельство выполнения программы аудита и его результатов.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П93_2017", "П. 9.3 Анализ со стороны руководства (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Высшее руководство должно анализировать систему экологического менеджмента организации через запланированные интервалы времени, чтобы гарантировать ее постоянную пригодность, соответствие и результативность.
	|Анализ менеджмента должен осуществляться с учетом:
	|a) статуса мероприятий, предусмотренных предыдущим анализом;
	|b) изменений в
	|1) состоянии внешних и внутренних факторов, которые важны для системы экологического менеджмента;
	|2) потребностях и ожиданиях заинтересованных сторон, включая обязательные требования;
	|3) существенных экологических аспектах;
	|4) рисках и возможностях;
	|c) степени, с которой были выполнены экологические цели;
	|d) информации о показателях экологической деятельности, включая тенденции в:
	|1) несоответствиях и корректирующих действиях;
	|2) результатах мониторинга и измерений;
	|3) выполнении обязательных требований;
	|4) результатах аудитов;
	|e) соответствия ресурсов;
	|f) значимых коммуникаций с заинтересованными сторонами, включая претензии;
	|g) возможностей для улучшения.
	|Результаты анализа менеджмента должны включать:
	|- заключения о постоянной пригодности, соответствию и результативности системы экологического менеджмента;
	|- решения, связанные с возможностями для улучшения;
	|- решения, связанные с любой потребностью в изменениях системы экологического менеджмента, включая ресурсы;
	|- действия, если необходимы, в тех случаях, когда экологические цели не были достигнуты;
	|- возможности для улучшения интеграции системы экологического менеджмента с другими бизнес-процессами, если необходимо;
	|- любые последствия для стратегического направления развития организации.
	|Организация должна сохранять документированную информацию как свидетельство результатов анализа менеджмента.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П101_2017", "П. 10.1 Общие положения (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна выявлять возможности для улучшения (см. 9.1, 9.2 и 9.3) и выполнять необходимые действия для достижения запланированных результатов ее системы экологического менеджмента.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П102_2017", "П. 10.2 Несоответствия и корректирующие действия (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"При выявлении несоответствия организация должна:
	|a) реагировать на несоответствие и, в той мере, насколько применимо:
	|1) предпринимать действия по управлению несоответствием и его исправлению;
	|2) предпринимать действия в отношении последствий, включая снижение негативных экологических воздействий;
	|b) оценивать потребность в действиях по устранению причин несоответствия с тем, чтобы оно не повторялось или не происходило в другом месте, посредством:
	|1) анализа несоответствия;
	|2) определения причин несоответствия;
	|3) выявления, есть ли подобные несоответствия или могли бы они потенциально произойти;
	|c) осуществлять любое необходимое действие;
	|d) анализировать результативность всех предпринятых корректирующих действий;
	|e) вносить изменения в систему экологического менеджмента, если необходимо.
	|Корректирующие действия должны соответствовать значимости последствий выявленных несоответствий, включая экологическое воздействие (воздействия).
	|Организация должна сохранять документированную информацию как свидетельство:
	|- характера несоответствий и любых последующих предпринятых мер;
	|- результатов любого корректирующего действия.");
	ПроверитьСоздатьПредопределенныйЭлемент("ИСО_П103_2017", "П. 10.3 Постоянное улучшение (ИСО 14001)", ВидНормативногоДокументаИСО, Дата(2017,01,03), Дата(2017,01,03), Дата(2017,01,03),
	"Организация должна постоянно улучшать пригодность, соответствие и результативность системы экологического менеджмента для улучшения показателей экологической деятельности.");
	
	// }EXTCODE 28.08.2017 Ушаков А.Е.
	
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // Процедура СоздатьЭлементыПредопределеныхЗначений()


// {EXTCODE 28.08.2017 Ушаков А.Е.
Процедура ПроверитьСоздатьПредопределенныйЭлемент(ИмяПредопределенныхДанных, Наименование, ВидНормативногоДокументаИСО, ДатаВступленияВСилу, ДатаУтверждения, Период, ТекстТребования)

	Элемент = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЗаконодательныеИНормативныеТребования." + ИмяПредопределенныхДанных);
	
	Если Элемент = Неопределено Тогда 
		
		НовЭлемент = Справочники.ЗаконодательныеИНормативныеТребования.СоздатьЭлемент();
		
		НовЭлемент.Наименование = Наименование;	
		НовЭлемент.ВидНормативногоДокумента = ВидНормативногоДокументаИСО.Ссылка;
		НовЭлемент.ОбластьДействияТребованийНормативныхДокументов = ПредопределенноеЗначение("Перечисление.ОбластиДействияТребований.ВнутренниеГазпром"); 
		НовЭлемент.НаименованиеПолное = Наименование;
		НовЭлемент.ДатаВступленияВСилу = ДатаВступленияВСилу;
		НовЭлемент.ДатаУтверждения     = ДатаУтверждения;

		НовЭлемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		
		НовЭлемент.Записать();
		
		Сведения = РегистрыСведений.СведенияОТребованиях.СоздатьНаборЗаписей();
		Сведения.Отбор.Требование.Установить(НовЭлемент.Ссылка);
		Сведения.Отбор.Период.Установить(Период);
		Сведения.Прочитать();
		
		НовСведение = Сведения.Добавить();
		
		НовСведение.Период          = Период;
		НовСведение.Требование      = НовЭлемент.Ссылка;
		НовСведение.ВидИзменения    = ПредопределенноеЗначение("Перечисление.ВидыИзмененийТребований.Добавлено");
		НовСведение.ТекстТребования = ТекстТребования;
		
		НовСведение.ЗначимостьТребования = ПредопределенноеЗначение("Перечисление.ЗначимостьТребований.Максимальная");
		НовСведение.СостояниеТребования  = ПредопределенноеЗначение("Перечисление.СостоянияТребований.Актуальное");
		
		Сведения.Записать();

	КонецЕсли; // Если Элемент = Неопределено Тогда

КонецПроцедуры

// }EXTCODE 28.08.2017 Ушаков А.Е.
#КонецЕсли

