
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Лаборатория) Тогда		
		Элементы.ВыбратьОборудование.Доступность = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Лаборатория") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Регистратор = Параметры.Регистратор;
		Элементы.ВыбратьОборудование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОборудование(Команда)
	
	ПараметрыФормы = СформироватьСтруктуруПараметров();
	ОткрытьФорму("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.ФормаВыбораОборудования",ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруПараметров()
	
	ПараметрыФормы = Новый Структура("Организация, Лаборатория", Объект.Организация, Объект.Лаборатория);
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Объект.Оборудование = Параметр.Оборудование;
	Объект.РегистрационныйНомер = Параметр.РегистрационныйНомер;
	Объект.ИнвентарныйНомер = Параметр.ИнвентарныйНомер;
	Объект.ЗаводскойНомер = Параметр.ЗаводскойНомер;
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Лаборатория) Тогда		
		Элементы.ВыбратьОборудование.Доступность = Истина;
	Иначе
		Элементы.ВыбратьОборудование.Доступность = Ложь;
		Объект.Оборудование = ПредопределенноеЗначение("Справочник.лис_ЛабораторноеОборудование.ПустаяСсылка");
		Объект.ИнвентарныйНомер = "";
		Объект.РегистрационныйНомер = "";
		Объект.ЗаводскойНомер = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Лаборатория) Тогда		
		Элементы.ВыбратьОборудование.Доступность = Истина;
	Иначе
		Элементы.ВыбратьОборудование.Доступность = Ложь;
		Объект.Оборудование = ПредопределенноеЗначение("Справочник.лис_ЛабораторноеОборудование.ПустаяСсылка");
		Объект.ИнвентарныйНомер = "";
		Объект.РегистрационныйНомер = "";
		Объект.ЗаводскойНомер = "";
	КонецЕсли;
	
КонецПроцедуры


