#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ДАВ 18.06.16 ++
	// GalaktionovVA; Выделение подсистемы ЛИС - Старт
	//РегистрыСведений.ДанныеКалендаряЭколога.УдалитьЗапись(Ссылка);
	//РегистрыСведений.ДанныеКалендаряЭколога.ДобавитьЗапись(Ссылка,Перечисления.ВидыСобытийКалендаряЭколога.ИстекСрокДействияРазрешительногоДокумента,ДатаСледующейПоверки, Перечисления.ТипыДокументовДляСроковПоКалендарюЭколога.ПоверкаПрибора);	
	// GalaktionovVA; Выделение подсистемы ЛИС - Финиш
	
	// Работа с бизнес-процессами
	Обработки.СозданиеНСИ.ЗапуститьБизнесПроцессСогласования( ЭтотОбъект.Ссылка );
	
КонецПроцедуры

Процедура ПередУдалением( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 11:15
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 11:15 Конец

	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Если Не Обработки.СозданиеНСИ.ЭлементДоступенДляРедактирования( Ссылка ) тогда
			Отказ = истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти