#Область СлужебныеПроцедурыИФункции

Функция ПроверитьКорректностьПроцентОчистки( фпПриродоохраннаяТехнология, фпЗагрязняющееВещество, фпПроцентОчистки ) Экспорт

	стрРезультат = "";

	Если ЗначениеЗаполнено( фпПриродоохраннаяТехнология ) И ЗначениеЗаполнено( фпЗагрязняющееВещество ) Тогда
		текНайденнаяСтрока = фпПриродоохраннаяТехнология.Эффетивность.Найти( фпЗагрязняющееВещество, "ЗагрязняющееВещество" );
		Если текНайденнаяСтрока <> Неопределено Тогда 
			Если фпПроцентОчистки < текНайденнаяСтрока.ПроцентОчисткиОт Или фпПроцентОчистки > текНайденнаяСтрока.ПроцентОчисткиДо Тогда 
				стрРезультат =	"Неверный процент очистки. По природоохранной технологии '" + 
								фпПриродоохраннаяТехнология + "' значение должно быть между " +
								текНайденнаяСтрока.ПроцентОчисткиОт + " и " +текНайденнаяСтрока.ПроцентОчисткиДо;
			КонецЕсли;
		Иначе
			стрРезультат =	"По природоохранной технологии '" + 
							фпПриродоохраннаяТехнология + "' для загрязняющего вещества '" +
							фпЗагрязняющееВещество + "' процент очистки не задан";
		КонецЕсли;
	КонецЕсли;

	Возврат стрРезультат;

КонецФункции

#КонецОбласти
