#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументовСправочников.ЗаполнитьДокумент(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр лис_ПриложениеКАттестатуАккредитации
	Движения.лис_ПриложениеКАттестатуАккредитации.Записывать = Истина;
	Для Каждого ТекСтрокаПриложение Из Приложение Цикл
		Движение = Движения.лис_ПриложениеКАттестатуАккредитации.Добавить();
		Движение.РазделУчета = ТекСтрокаПриложение.РазделУчета;
		Движение.Лаборатория = Лаборатория;
		Движение.ЗагрязняющееВещество = ТекСтрокаПриложение.ЗагрязняющееВещество;
		Движение.Методика = ТекСтрокаПриложение.Методика;
		Движение.ДиапазонОт = ТекСтрокаПриложение.ДиапазонОт;
		Движение.ДиапазонДо = ТекСтрокаПриложение.ДиапазонДо;
		Движение.ЕдиницаИзмерения = ТекСтрокаПриложение.ЕдиницаИзмерения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
