#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// (++) Зиновьев А.В., 12.08.2016,
	// Закомментировал код получения СРЗ до появления нужного ресурса РС в системе.
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//	|	НормативыКачестваОкружающейСредыВеществаСрезПоследних.СреднееРегиональноеЗначение
	//	|ИЗ
	//	|	РегистрСведений.НормативыКачестваОкружающейСредыВещества.СрезПоследних(, (ВЫРАЗИТЬ(ЗагрязняющееВещество КАК Справочник.ВеществаИПараметрыВАтмосферныхОсадках)) = &ЗагрязняющееВещество) КАК НормативыКачестваОкружающейСредыВеществаСрезПоследних";
	//
	//Запрос.УстановитьПараметр("ЗагрязняющееВещество", Объект.Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	НормативыКачества = ВыборкаДетальныеЗаписи.СреднееРегиональноеЗначение;
	//	
	//КонецЦикла;
	
	// (--) Зиновьев А.В., 12.08.2016, 
	
КонецПроцедуры

#КонецОбласти
