
Функция ПечатьНаклеек(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.ЛабораторноеОборудованиеВЭксплуатации.ПолучитьМакет("НаклейкиНаОборудование");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ЛабораторноеОборудование.ТемператураОкружающейСредыОт КАК От,
	|	лис_ЛабораторноеОборудование.ТемператураОкружающейСредыДо КАК До,
	|	лис_ЛабораторноеОборудование.ОтносительнаяВлажность,
	|	лис_ЛабораторноеОборудование.МаксимальнаяПотребляемаяМощность,
	|	лис_ЛабораторноеОборудование.ПитаниеНапряжение КАК Напряжение,
	|	лис_ЛабораторноеОборудование.ПитаниеЧастота КАК Частота,
	|	лис_ЛабораторноеОборудование.Наименование КАК НаименованиеОборудования
	|ИЗ
	|	Справочник.лис_ЛабораторноеОборудование КАК лис_ЛабораторноеОборудование
	|ГДЕ
	|	лис_ЛабораторноеОборудование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьДанные = Макет.ПолучитьОбласть("УсловияЭксплуатации");
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.ТемператураОкружающейСреды = Выборка.От + "-" + Выборка.До;
	КонецЕсли;
	ТабДок.Вывести(ОбластьДанные);
	
	ОбластьДанные = Макет.ПолучитьОбласть("ДанныеОборудования");
	ОбластьДанные.Параметры.НаименованиеОборудования = МассивОбъектов[0];
	ОбластьДанные.Параметры.РегистрационныйНомер = МассивОбъектов[1];
	ОбластьДанные.Параметры.ЗаводскойНомер = МассивОбъектов[2];
	ОбластьДанные.Параметры.ИнвентарныйНомер = МассивОбъектов[3];
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.Период КАК ДатаПериодическойАттестации,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ДатаСледующейПоверки КАК СрокПоследующейАттестации
	|ИЗ
	|	РегистрСведений.лис_ПоверкиЛабораторногоОборудования.СрезПоследних(
	|			&Дата,
	|			ЛабораторноеОборудование = &ЛабораторноеОборудование
	|				И ИнвентарныйНомер = &ИнвентарныйНомер
	|				И РегистрационныйНомер = &РегистрационныйНомер
	|				И ЗаводскойНомер = &ЗаводскойНомер) КАК лис_ПоверкиЛабораторногоОборудованияСрезПоследних";
	Запрос.УстановитьПараметр("ЛабораторноеОборудование", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("РегистрационныйНомер", МассивОбъектов[1]);
	Запрос.УстановитьПараметр("ЗаводскойНомер", МассивОбъектов[2]);
	Запрос.УстановитьПараметр("ИнвентарныйНомер", МассивОбъектов[3]);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьДанные.Параметры.Заполнить(Выборка);
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьДанные);
	
	Возврат ТабДок;

	
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НаклейкиНаОборудование", "Наклейки на оборудование",
			ПечатьНаклеек(МассивОбъектов, ОбъектыПечати),, "РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.НаклейкиНаОборудование");
	
КонецПроцедуры