
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОборудованиеВЭксплуатации.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Владелец);
		ОборудованиеВЭксплуатации.Параметры.УстановитьЗначениеПараметра("Лаборатория", Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСведенияОбОборудовании(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
		ПараметрыФормы = СформироватьСтруктуруСведений(ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.СведенияОбОборудовании", ПараметрыФормы
					,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;				
				
КонецПроцедуры


&НаСервере
Функция СформироватьСтруктуруСведений(ТекущаяСтрока)
	
	ПараметрыФормы = Новый Структура("Организация, Лаборатория, Оборудование, РегистрационныйНомер, ИнвентарныйНомер, ЗаводскойНомер, 
								| ЗаводскоеОбозначение, НомерПаспортаНаОборудование, ДатаИзготовления, 
								| ДатаВводаВЭксплуатацию, СрокДопустимойЭксплуатации");
	ПараметрыФормы.Организация = Объект.Владелец;
	ПараметрыФормы.Лаборатория = Объект.Ссылка;
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущаяСтрока);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументОПоверке(Команда)
	
	ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
	ПараметрыФормы = СформироватьПараметрыФормы(ТекущаяСтрока);
	ОткрытьФорму("Документ.лис_ПоверкаЛабораторногоОборудования.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументОРемонте(Команда)
	
	ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
	ПараметрыФормы = СформироватьПараметрыФормы(ТекущаяСтрока);
	ОткрытьФорму("Документ.лис_ОтправкаВРемонтЛабораторногоОборудования.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьДокументПеремещения(Команда)
	
	ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
	ПараметрыФормы = СформироватьПараметрыФормы(ТекущаяСтрока);
	ОткрытьФорму("Документ.лис_ОтметкаМестонахожденияЛабораторногоОборудования.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыФормы(ТекущаяСтрока)
	
	ПараметрыФормы = Новый Структура("Регистратор, Организация, Лаборатория, Оборудование, РегистрационныйНомер, ИнвентарныйНомер, ЗаводскойНомер");
	ПараметрыФормы.Организация = Объект.Владелец;
	ПараметрыФормы.Лаборатория = Объект.Ссылка;
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущаяСтрока);
	
	Возврат ПараметрыФормы;
	
КонецФункции




