
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	ТипКонтрагента = Перечисления.ТипыКонтрагента.УчебныйЦентрЛаборатория;
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДействуетПоДоверенностиПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаЭкологиюПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаОбращениеСОтходамиПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СклейкаФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СклейкаФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СклейкаФИО();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ЭлементыФормы.РеквизитыДоверенности.Доступность = Объект.ДействуетПоДоверенности;
	
КонецПроцедуры

&НаКлиенте
Процедура СклейкаФИО()
	
	Объект.Наименование = ?(ЗначениеЗаполнено(Объект.Фамилия),Объект.Фамилия,"") + ?(ЗначениеЗаполнено(Объект.Имя)," " + Объект.Имя,"") + ?(ЗначениеЗаполнено(Объект.Отчество)," " + Объект.Отчество,"");
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Объект.ДатаРождения = ПолучитьДатуРожденияФизЛица();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуРожденияФизЛица()

	Возврат Объект.ФизическоеЛицо.ДатаРождения;

КонецФункции 

#КонецОбласти

