#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья() Экспорт 
	
	масСписокВидовВодныхОбъектов = Новый Массив;
	
	масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.Река );
	масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.ПодземныйВодныйОбъект );
	масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.ШахтаРудникНефтепромыселКарьер );
	
	Возврат масСписокВидовВодныхОбъектов;
	
КонецФункции

#КонецОбласти
