#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Набор = РегистрыСведений.ЛабораторноеОборудованиеВЭксплуатации.СоздатьНаборЗаписей();
	//Набор.Отбор.Регистратор.Установить(Организация);
	Набор.Отбор.Лаборатория.Установить(Лаборатория);
	Набор.Отбор.Оборудование.Установить(Оборудование);
	Набор.Отбор.РегистрационныйНомер.Установить(РегистрационныйНомер);
	Набор.Отбор.ИнвентарныйНомер.Установить(ИнвентарныйНомер);
	Набор.Отбор.ЗаводскойНомер.Установить(ЗаводскойНомер);
	Набор.Прочитать();
	
	Запись = Набор[0];	

	Запись.Организация = НовоеМестонахождение.Владелец;
	Запись.Лаборатория = НовоеМестонахождение;
	
	Набор.Записать();
	
	//Движения.лис_МестонахождениеЛабораторногоОборудования.Записывать = Истина;
	//Движение = Движения.лис_МестонахождениеЛабораторногоОборудования.Добавить();
	//Движение.Период = Дата;
	//Движение.ЛабораторноеОборудование = ЛабораторноеОборудование.Оборудование;
	//Движение.Лаборатория = Лаборатория;
	//Движение.Местонахождение = Местонахождение;
	
КонецПроцедуры

#КонецОбласти