#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПланОтбораПроб = Неопределено;
	Если Параметры.Свойство("ПланОтбораПроб", ПланОтбораПроб) Тогда
		Элементы.ПланыОтбораПроб.ТекущаяСтрока = ПланОтбораПроб;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыОтбораПробОсновноеВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Результат = новый Структура;
	Результат.Вставить("ПланОтбораПроб", Элементы.ПланыОтбораПроб.ТекущаяСтрока);
	Результат.Вставить("ИндексПробы", Значение);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
