
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СведенияОТребованияхСрезПоследних.ТекстТребования
		|ИЗ
		|	РегистрСведений.СведенияОТребованиях.СрезПоследних(, Требование = &Требование) КАК СведенияОТребованияхСрезПоследних";
		 Запрос.УстановитьПараметр("Требование",Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			ЭтотОбъект.ТекстТребования = Выборка.ТекстТребования;
		
		КонецЦикла;
	Иначе
		Элементы.ГруппаТекстТребования.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры
