#Область СлужебныеПроцедурыИФункции
	//Процедура ПриЗаписи(Отказ)
	//	ТекСсылка = Ссылка;
	//	НаборЗаписейРС = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
	//	НаборЗаписейРС.Отбор.ФизическоеЛицо.Установить(ТекСсылка);
	//	НоваяЗаписьРС = НаборЗаписейРС.Добавить();
	//	
	//	НоваяЗаписьРС.ФизическоеЛицо = ТекСсылка;
	//	НоваяЗаписьРС.Период = ТекущаяДатаСеанса();
	//	НоваяЗаписьРС.Фамилия = Фамилия;
	//	НоваяЗаписьРС.Имя = Имя;
	//	НоваяЗаписьРС.Отчество = Отчество;
	//	
	//	НаборЗаписейРС.Записать(Истина);
	//КонецПроцедуры
	Процедура ПередУдалением(Отказ)
    	ТекСсылка = Ссылка;
		НаборЗаписейРС = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписейРС.Отбор.ФизическоеЛицо.Установить(ТекСсылка);
		
		НаборЗаписейРС.Записать(Истина);
	КонецПроцедуры
#КонецОбласти