#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	УправлениеВидимостью(ЭтаФорма);
	
	
	ЭтаФорма.Элементы.GUID.Видимость = Ложь;
	ЭтаФорма.Элементы.ДекорацияДляСдвигаВнизПролонгации.Видимость = Истина;

	Элементы.GUID.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПериодДоговора.ДатаНачала = Объект.СрокДействияС;
	ПериодДоговора.ДатаОкончания = Объект.СрокДействияПо;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	Объект.Наименование = Объект.НомерДоговора;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПлатыЗаНВнаОСПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДоговораПриИзменении(Элемент)
	
	Объект.СрокДействияС = ПериодДоговора.ДатаНачала;
	Объект.СрокДействияПо = ПериодДоговора.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ДатаНачалаОплатыКонтрагентом.Видимость 	= (Форма.Объект.ДоговорПлатыЗаНВнаОС = Истина);
	ЭлементыФормы.ДатаОкончанияОплатыКонтрагентом.Видимость = (Форма.Объект.ДоговорПлатыЗаНВнаОС = Истина);
	
	Если Форма.Объект.ДоговорПлатыЗаНВнаОС = Ложь Тогда
		Форма.Объект.ДатаНачалаОплатыКонтрагентом 			= Неопределено;
		Форма.Объект.ДатаОкончанияОплатыКонтрагентом 		= Неопределено;
	КонецЕсли;
	
	ЭлементыФормы.ПлатаЗаНВнаОСПоСписку.Видимость 			= (Форма.Объект.ДоговорПлатыЗаНВнаОС = Истина);

	
КонецПроцедуры

&НаКлиенте
Процедура ПлатаЗаНВнаОСПоСпискуПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);	
			
КонецПроцедуры

#КонецОбласти
	