#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСтрокуАдминистративныеРайоны();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаАдминистративныйРайонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭлементыОКАТО = Новый Массив;
	
	ЭлементыОКАТО = ПолучитьАдминистративныеРайоны();
	
	ЗначениеОтбора = Новый Структура("Ссылка",ЭлементыОКАТО);
	
	ПараметрыПодбора = Новый Структура("МножественныйВыбор", Истина);	
	
	ПараметрыПодбора.Вставить("Отбор",ЗначениеОтбора);
	
	ОткрытьФорму("Справочник.ОКАТО.ФормаВыбора",ПараметрыПодбора,Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьАдминистративныеРайоны()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОКАТО.Ссылка
		|ИЗ
		|	Справочник.ОКАТО КАК ОКАТО
		|ГДЕ
		|	(ОКАТО.Код ПОДОБНО ""7114%""
		|			ИЛИ ОКАТО.Код ПОДОБНО ""7115%""
		|			ИЛИ ОКАТО.Код ПОДОБНО ""7116%""
		|			ИЛИ ОКАТО.Код ПОДОБНО ""7117%"")
		|	И НЕ ОКАТО.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СтрокаАдминистративныйРайонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивРайонов = Новый Массив();
	МассивРайонов = ВыбранноеЗначение;
	
	Объект.АдминистративныеРайоны.Очистить();

	СтрокаАдминистративныйРайон = "";
	
	Для каждого Район Из МассивРайонов Цикл
		
		НоваяСтрока = Объект.АдминистративныеРайоны.Добавить();
		НоваяСтрока.АдминистративныйРайонПроведенияРабот = Район;
		СтрокаАдминистративныйРайон = СтрокаАдминистративныйРайон + Район + "; ";
		
	КонецЦикла; 
	
	Если Не ПустаяСтрока(СтрокаАдминистративныйРайон) Тогда
		
		СтрокаАдминистративныйРайон = Лев(СтрокаАдминистративныйРайон,СтрДлина(СтрокаАдминистративныйРайон) - 2);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтрокуАдминистративныеРайоны()
	
	Для каждого Строка Из Объект.АдминистративныеРайоны Цикл
		
		СтрокаАдминистративныйРайон = СтрокаАдминистративныйРайон + Строка.АдминистративныйРайонПроведенияРабот + "; ";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(СтрокаАдминистративныйРайон) Тогда
		
		СтрокаАдминистративныйРайон = Лев(СтрокаАдминистративныйРайон,СтрДлина(СтрокаАдминистративныйРайон) - 2);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
