
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПолучитьМестонахождениеЛабораторногоОборудования();
	//	ПолучитьСостояниеЛабораторногоОборудования();
	//	ПолучитьКопиюДокументаОПоверкеИДатуПоследнейПоверки();
	//Иначе
	//	Элементы.ВыбратьСодержаниеПаспортаИзПрисоединенныхФайлов.Доступность = Ложь;
	//	Элементы.ОчиститьСодержаниеПаспорта.Доступность = Ложь;
	//КонецЕсли;
		
КонецПроцедуры

//&НаСервере
//Процедура ПолучитьМестонахождениеЛабораторногоОборудования()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	лис_МестонахождениеЛабораторногоОборудованияСрезПоследних.Местонахождение
//	|ИЗ
//	|	РегистрСведений.лис_МестонахождениеЛабораторногоОборудования.СрезПоследних КАК лис_МестонахождениеЛабораторногоОборудованияСрезПоследних
//	|ГДЕ
//	|	лис_МестонахождениеЛабораторногоОборудованияСрезПоследних.ЛабораторноеОборудование = &ЛабораторноеОборудование";
//	
//	Запрос.УстановитьПараметр("ЛабораторноеОборудование", Объект.Ссылка);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		ЭтаФорма.МестонахождениеЛабораторногоОборудования = Выборка.Местонахождение;
//	КонецЕсли;
//			
//КонецПроцедуры

//&НаСервере
//Процедура ПолучитьСостояниеЛабораторногоОборудования()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	лис_СостоянияЛабораторногоОборудованияСрезПоследних.Состояние
//	|ИЗ
//	|	РегистрСведений.лис_СостоянияЛабораторногоОборудования.СрезПоследних КАК лис_СостоянияЛабораторногоОборудованияСрезПоследних
//	|ГДЕ
//	|	лис_СостоянияЛабораторногоОборудованияСрезПоследних.ЛабораторноеОборудование = &ЛабораторноеОборудование";
//	
//	Запрос.УстановитьПараметр("ЛабораторноеОборудование", Объект.Ссылка);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		ЭтаФорма.СостояниеЛабораторногоОборудования = Выборка.Состояние;
//	КонецЕсли;
//			
//КонецПроцедуры

//&НаСервере
//Процедура ПолучитьКопиюДокументаОПоверкеИДатуПоследнейПоверки()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.Регистратор.КопияДокументаОПоверке КАК КопияДокументаОПоверке,
//	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.Регистратор.Дата КАК Дата
//	|ИЗ
//	|	РегистрСведений.лис_ПоверкиЛабораторногоОборудования.СрезПоследних КАК лис_ПоверкиЛабораторногоОборудованияСрезПоследних
//	|ГДЕ
//	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ЛабораторноеОборудование = &ЛабораторноеОборудование
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Дата УБЫВ";
//	
//	Запрос.УстановитьПараметр("ЛабораторноеОборудование", Объект.Ссылка);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		КопияДокументаОПоверке = Выборка.КопияДокументаОПоверке;
//		ДатаПоследнейПоверки = Выборка.Дата;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьСодержаниеПаспортаИзПрисоединенныхФайлов(Команда)
//	
//	СтруктураПараметрыВыбора =
//		Новый Структура("ВладелецФайла, ЗакрыватьПриВыборе, РежимВыбора", Объект.Ссылка, Истина, Истина);

//	ОткрытьФорму(
//		"ОбщаяФорма.ПрисоединенныеФайлы",
//		СтруктураПараметрыВыбора,,,,,
//		Новый ОписаниеОповещения("ВыбратьСодержаниеПаспортаИзПрисоединенныхФайловЗавершение", ЭтотОбъект),
//		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
//	
//КонецПроцедуры
//	
//&НаКлиенте
//Процедура ОчиститьСодержаниеПаспорта(Команда)
	
//	Объект.СодержаниеПаспортаНаОборудование = ПредопределенноеЗначение("Справочник.лис_ЛабораторноеОборудованиеПрисоединенныеФайлы.ПустаяСсылка");
//	ЭтотОбъект.Модифицированность = Истина;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Элементы.ВыбратьСодержаниеПаспортаИзПрисоединенныхФайлов.Доступность = Истина;
	//	Элементы.ОчиститьСодержаниеПаспорта.Доступность = Истина;		
	//КонецЕсли;	
	
КонецПроцедуры


