#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		// GalaktionovVA; Выделение подсистемы ЛИС - Старт
		//ПолучитьЗначениеНормативаПлаты();
		// GalaktionovVA; Выделение подсистемы ЛИС - Финиш
	Иначе
		Элементы.ГруппаНормативПлаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		// GalaktionovVA; Выделение подсистемы ЛИС - Старт
		//ПолучитьЗначениеНормативаПлаты();
		// GalaktionovVA; Выделение подсистемы ЛИС - Финиш
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// GalaktionovVA; Выделение подсистемы ЛИС - Старт
//&НаСервере
//Процедура ПолучитьЗначениеНормативаПлаты()
//	
//	Отбор = Новый Структура("ЗагрязняющееВещество", Объект.Ссылка);
//	СтруктураНормативов = РегистрыСведений.НормативыПлатыЗаНегативноеВоздействие.ПолучитьПоследнее(ТекущаяДата(), Отбор);
//	НормативПлатыПДС = СтруктураНормативов.НормативВПределахНорм;
//	НормативПлатыВСС = СтруктураНормативов.НормативВПределахЛимитов;
//	
//КонецПроцедуры
// GalaktionovVA; Выделение подсистемы ЛИС - Финиш

#КонецОбласти
