Функция ПечатьЖурналОпределенияКомпонентовВПромышленныхВыбросах(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах_ЖурналОпределенияКомпонентовВПромышленныхВыбросах";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.ПФ_MXL_ЖурналОпределенияКомпонентовВПромышленныхВыбросах");
		
	Для каждого ТекущийОбъект из МассивОбъектов Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка
		Область = Макет.ПолучитьОбласть("ОбластьШапка");
		ТабличныйДокумент.Вывести(Область);
		
		НЗ = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(ТекущийОбъект);
		НЗ.Прочитать();
		
		Номер = 0;
		// Строки
		Для каждого Проба из НЗ Цикл
			
			Номер = Номер + 1;
			Область = Макет.ПолучитьОбласть("ОбластьСтрока");
			Область.Параметры.Номер = Номер;
			Область.Параметры.Дата = Формат(Проба.ДатаОтбора, "ДФ=dd.MM.yy");
			Область.Параметры.Заполнить(Проба);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	    // Подвал
		Область = Макет.ПолучитьОбласть("ОбластьПодвал");
		Область.Параметры.Ответственный = ТекущийОбъект.Ответственный;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции	

// Формирует печатные формы
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВПромышленныхВыбросах") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВПромышленныхВыбросах", "Журнал определения компонентов в промышленных выбросах",
			ПечатьЖурналОпределенияКомпонентовВПромышленныхВыбросах(МассивОбъектов, ОбъектыПечати),, "Документ.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.ПФ_MXL_ЖурналОпределенияКомпонентовВПромышленныхВыбросах");
			
	КонецЕсли; 
	
КонецПроцедуры
