
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.ФормаСписка" Тогда
		ТекущаяСтрока = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущиеДанные; 
		//СтруктураСведений = СформироватьСтруктуру(ТекущаяСтрока);
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ТекущаяСтрока.Оборудование);
		ПараметрКоманды.Добавить(ТекущаяСтрока.РегистрационныйНомер);
		ПараметрКоманды.Добавить(ТекущаяСтрока.ЗаводскойНомер);
		ПараметрКоманды.Добавить(ТекущаяСтрока.ИнвентарныйНомер);
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.ИмяФормы = "РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.СведенияОбОборудовании" Тогда
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.Оборудование);
		ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.РегистрационныйНомер);
		ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.ЗаводскойНомер);
		ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.ИнвентарныйНомер);
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.лис_Лаборатории.Форма.ФормаЭлемента" Тогда
		//ПараметрКоманды = Новый Массив;
		//ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.Оборудование);
		//ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.РегистрационныйНомер);
		//ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.ЗаводскойНомер);
		//ПараметрКоманды.Добавить(ПараметрыВыполненияКоманды.Источник.ИнвентарныйНомер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации", "НаклейкиНаОборудование", ПараметрКоманды, ПараметрыВыполненияКоманды.Источник);
	КонецЕсли;	
	
КонецПроцедуры

//&НаСервере
//Функция СформироватьСтруктуру(ТекущаяСтрока)
//	
//	СтруктураСведений = Новый Структура("Организация, Лаборатория, Оборудование, ИнвентарныйНомер, ЗаводскойНомер, 
//								| ЗаводскоеОбозначение, НомерПаспортаНаОборудование, ДатаИзготовления, 
//								| ДатаВводаВЭксплуатацию, СрокДопустимойЭксплуатации");
//	ЗаполнитьЗначенияСвойств(СтруктураСведений, ТекущаяСтрока);
//	
//	Возврат СтруктураСведений;
//	
//КонецФункции
