
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Установка отбора в зависимости от раздела контроля.
	Если Параметры.Свойство("ОтборПоРазделуКонтроля") Тогда 																	  
		
		Если Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы") Или
			Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ФизическиеФакторы") Тогда 
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Истина);
			Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Ложь);
			
		ИначеЕсли Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения") Тогда
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Истина);
			
		Иначе
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Ложь);
						
		КонецЕсли; // Если Параметры.ОтборПоРазделуКонтроля = ПредопределенноеЗначени 
		
	Иначе	
		
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПочваФизФакторы", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборДонныеОтложения", Ложь);
		
	КонецЕсли; // Если Параметры.Свойство("ОтборПочваФизФакторы") Тогда
	
	// (++) Зиновьев А.В., 28.02.2017
	Если Параметры.Свойство("ЛицензионныйУчасток") Тогда		
		Список.Параметры.УстановитьЗначениеПараметра("ЛицензионныйУчасток", Параметры.ЛицензионныйУчасток);		
	Иначе	
		Список.Параметры.УстановитьЗначениеПараметра("ЛицензионныйУчасток", ПредопределенноеЗначение("Справочник.ЛицензионныеУчастки.ПустаяСсылка"));		
	КонецЕсли; 
	// (--) Зиновьев А.В., 28.02.2017
	
	// (++) Зиновьев А.В., 29.05.2017
	// Отбор по линейному объекту.
	Если Параметры.Свойство("ЛинейныйОбъект") Тогда
		
		Если Параметры.Отбор.Свойство("ОбъектКонтроля") Тогда
			Параметры.Отбор.Удалить("ОбъектКонтроля");
		КонецЕсли; 
		
		Группа = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		Группа.Использование = Истина;
		Группа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
		
		ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектКонтроля");
		ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.Использование	= Истина;
		ЭлОтбора.ПравоеЗначение = Параметры.ЛинейныйОбъект;
		
		ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛинейныйОбъект");
		ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.Использование	= Истина;
		ЭлОтбора.ПравоеЗначение = Параметры.ЛинейныйОбъект;	
		
	КонецЕсли;
	// (--) Зиновьев А.В., 29.05.2017
	
	
	
КонецПроцедуры // Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

