
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.Список.Отбор.Элементы.Получить(0).ПравоеЗначение) Тогда
		ОрганизацияОтбора = ПараметрыВыполненияКоманды.Источник.Список.Отбор.Элементы.Получить(0).ПравоеЗначение;
	Иначе
		ОрганизацияОтбора = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	КонецЕсли;
		
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Сотрудники", "СведенияОРаботникахЛаборатории", ПолучитьСотрудников(ОрганизацияОтбора), ПараметрыВыполненияКоманды.Источник);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудников(Организация)
	
	МассивОбъектов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		МассивОбъектов = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции
