#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РасчитатьСреднееЭквивалентноеЗначение()
	
	Запись.СреднийУровеньЗвукаЭквивалентный = (Запись.ЭквивалентныйУровеньЗвука1 + Запись.ЭквивалентныйУровеньЗвука2 
		+ Запись.ЭквивалентныйУровеньЗвука3 + Запись.ЭквивалентныйУровеньЗвука4) / 4;
	
КонецФункции

&НаКлиенте
Функция РасчитатьСреднееМаксимальноеЗначение()
	
	Запись.СреднийУровеньЗвукаМаксимальный = (Запись.МаксимальныйУровеньЗвука1 + Запись.МаксимальныйУровеньЗвука2 
		+ Запись.МаксимальныйУровеньЗвука3 + Запись.МаксимальныйУровеньЗвука4) / 4;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	

КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука1ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука2ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука3ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквивалентныйУровеньЗвука4ПриИзменении(Элемент)
	
	РасчитатьСреднееЭквивалентноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука1ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука2ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука3ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйУровеньЗвука4ПриИзменении(Элемент)
	
	РасчитатьСреднееМаксимальноеЗначение();
	
КонецПроцедуры



#КонецОбласти

