#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

	ВывестиКоэффициентыНаФорму();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.НаименованиеПолное;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьКоэффициенты();

КонецПроцедуры

&НаСервере
Процедура ВывестиКоэффициентыНаФорму()
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// Выведем действующие коэффициенты
	КоэффициентЭкологическойЗначимостиДляВоздуха 	= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДатаСеанса(),
																												Новый Структура("Коэффициент, ОКТМО",
																																Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух,
																																Объект.Ссылка)).Значение;
	КоэффициентЭкологическойЗначимостиДляПочвы 		= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДатаСеанса(),
																												  Новый Структура("Коэффициент, ОКТМО",
																																  Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы,
																																  Объект.Ссылка)).Значение;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияКоэффициентовСрезПоследних.Период,
	|	ЗначенияКоэффициентовСрезПоследних.БассейновыйОкруг,
	|	ЗначенияКоэффициентовСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияКоэффициентов.СрезПоследних(
	|			&Период,
	|			ОКТМО = &ОКТМО
	|				И Коэффициент = &Коэффициент) КАК ЗначенияКоэффициентовСрезПоследних";
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ОКТМО", Объект.Ссылка);
	Запрос.УстановитьПараметр("Коэффициент", Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода);

	КоэффициентыЭкологическойЗначимостиДляВоды.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	// НовыйНабор = РеквизитФормыВЗначение("КоэффициентыЭкологическойЗначимостиДляВоды");
	//       	
	// //КоэффициентыЭкологическойЗначимостиДляВоды.Отбор.Коэффициент.Установить(Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода);
	// НовыйНабор.Отбор.Коэффициент.Значение 		= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода;
	// НовыйНабор.Отбор.Коэффициент.Использование 	= Истина;
	//
	// //КоэффициентыЭкологическойЗначимостиДляВоды.Отбор.ОКТМО.Установить(Объект.Ссылка);
	// НовыйНабор.Отбор.ОКТМО.Значение 			= Объект.Ссылка;
	// НовыйНабор.Отбор.ОКТМО.Использование 		= Истина;
	//
	// НовыйНабор.Прочитать();
	// ЗначениеВДанныеФормы(НовыйНабор, КоэффициентыЭкологическойЗначимостиДляВоды);

КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыЭкологическойЗначимостиДляВодыПриИзменении(Элемент)

	Если ЭтаФорма.Элементы.КоэффициентыЭкологическойЗначимостиДляВоды.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.Элементы.КоэффициентыЭкологическойЗначимостиДляВоды.ТекущиеДанные.Период = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьКоэффициенты()
		
	// запишем действующие коэффициенты
	старыйКоэффициентЭкологическойЗначимостиДляВоздуха 	= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДата(),
																													  Новый Структура("Коэффициент, ОКТМО",
																																	  Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух,
																																	  Объект.Ссылка)).Значение;
	Если старыйКоэффициентЭкологическойЗначимостиДляВоздуха <> КоэффициентЭкологическойЗначимостиДляВоздуха
		 И ЗначениеЗаполнено(КоэффициентЭкологическойЗначимостиДляВоздуха) Тогда
		МенеджерЗаписи 				= РегистрыСведений.ЗначенияКоэффициентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Коэффициент 	= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух;
		МенеджерЗаписи.ОКТМО		= Объект.Ссылка;
		МенеджерЗаписи.Период 		= ТекущаяДата();
		МенеджерЗаписи.Значение		= КоэффициентЭкологическойЗначимостиДляВоздуха;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;

	старыйКоэффициентЭкологическойЗначимостиДляПочвы 	= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДата(),
																													Новый Структура("Коэффициент, ОКТМО",
																																	Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы,
																																	Объект.Ссылка)).Значение;
	Если старыйКоэффициентЭкологическойЗначимостиДляПочвы <> КоэффициентЭкологическойЗначимостиДляПочвы
		 И ЗначениеЗаполнено(КоэффициентЭкологическойЗначимостиДляПочвы) Тогда
		МенеджерЗаписи 				= РегистрыСведений.ЗначенияКоэффициентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Коэффициент 	= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы;
		МенеджерЗаписи.ОКТМО		= Объект.Ссылка;
		МенеджерЗаписи.Период 		= ТекущаяДата();
		МенеджерЗаписи.Значение		= КоэффициентЭкологическойЗначимостиДляПочвы;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ЗначенияКоэффициентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Коэффициент.Установить(Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода);
	НаборЗаписей.Отбор.ОКТМО.Установить(Объект.Ссылка);
	НаборЗаписей.Отбор.Период.Установить(НачалоДня(ТекущаяДата()));
	НаборЗаписей.Прочитать();

	НаборЗаписей.Очистить();

	Для Каждого СтрокаКоэффициентов Из КоэффициентыЭкологическойЗначимостиДляВоды Цикл

		Если НачалоДня(СтрокаКоэффициентов.Период) <> НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.Период 				= СтрокаКоэффициентов.Период;
		НоваяЗапись.Коэффициент 		= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода;
		НоваяЗапись.ОКТМО 				= Объект.Ссылка;
		НоваяЗапись.БассейновыйОкруг 	= СтрокаКоэффициентов.БассейновыйОкруг;
		НоваяЗапись.Значение 			= СтрокаКоэффициентов.Значение;

	КонецЦикла;

	Если НаборЗаписей.Количество() > 0 Тогда
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоэффициентЭкологическойЗначимостиДляВоздуха(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОКТМО", Объект.Ссылка);
	ПараметрыОтбора.Вставить("Коэффициент",
							 ПредопределенноеЗначение("Справочник.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОткрытьФорму("РегистрСведений.ЗначенияКоэффициентов.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоэффициентЭкологическойЗначимостиДляПочвы(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОКТМО", Объект.Ссылка);
	ПараметрыОтбора.Вставить("Коэффициент",
							 ПредопределенноеЗначение("Справочник.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОткрытьФорму("РегистрСведений.ЗначенияКоэффициентов.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоэффициентЭкологическойЗначимостиДляВоды(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОКТМО", Объект.Ссылка);
	ПараметрыОтбора.Вставить("Коэффициент",
							 ПредопределенноеЗначение("Справочник.Коэффициенты.КоэффициентЭкологическойЗначимостиВода"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОткрытьФорму("РегистрСведений.ЗначенияКоэффициентов.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПовторяемостьГрадацийСкоростейВетра(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОКТМО", Объект.Ссылка);

	ОткрытьФорму("РегистрСведений.ПовторяемостьГрадацийСкоростейВетра.Форма.ФормаОКТМО",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСреднемесячныеТемпературыВоздуха(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОКТМО", Объект.Ссылка);

	ОткрытьФорму("РегистрСведений.СреднемесячныеТемпературыВоздуха.Форма.ФормаОКТМО",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

#КонецОбласти