#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ПравоВодоотведения";
	//КомандаПечати.Идентификатор = "ПланМероприятий";
	//КомандаПечати.Представление = НСтр("ru = 'План мероприятий'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати   - СписокЗначений - значение - ссылка на объект;
//                                     представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура      - дополнительные параметры сформированных 
//                                     табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланМероприятий");
	//Если НужноПечататьМакет Тогда
	//	
	//    // Формируем табличный документ и добавляем его в коллекцию печатных форм.
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм,
	//		"ПланМероприятий",
	//		НСтр("ru = 'План мероприятий'"),
	//		ПечатьОтчетОВыполнении(МассивОбъектов, ОбъектыПечати));
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьОтчетОВыполнении(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПравоВодоотведения.ПланМероприятий");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПланМероприятий";
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравоВодоотведения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПравоВодоотведения КАК ПравоВодоотведения
	|ГДЕ
	|	ПравоВодоотведения.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ПечатаемыйДокумент = Запрос.Выполнить().Выбрать();
	ПервыйДокумент = Истина;
	Пока ПечатаемыйДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ТабличныйДокумент.Вывести(ОбластьШапка);		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПравоВодоотведенияПланМероприятий.НомерСтроки КАК НомерПП,
		|	ПравоВодоотведенияПланМероприятий.Мероприятие.Наименование КАК НаименованиеМероприятия,
		|	ПравоВодоотведенияПланМероприятий.Выполнение КАК ИнформацияОВыполнении
		|ИЗ
		|	Документ.ПравоВодоотведения.ПланМероприятий КАК ПравоВодоотведенияПланМероприятий
		|ГДЕ
		|	ПравоВодоотведенияПланМероприятий.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ПечатаемыйДокумент.Ссылка);
		Строка = Запрос.Выполнить().Выбрать();		
		Пока Строка.Следующий() Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,Строка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьПодвал);		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ПечатаемыйДокумент.Ссылка);
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
