&НаКлиенте
Перем ТекСостояниеСезонности;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//для новых элементов создаем 3 строки в ТЧ ПоказателиПоСезонности: 0 - ВесьГод, 1-Зима, 2-Лето
	Если Объект.ПоказателиПоСезонности.Количество() = 0 Тогда
		НовСтр = Объект.ПоказателиПоСезонности.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Объект);
		НовСтр.Сезонность = Перечисления.Сезонность.ВесьГод;
		
		НовСтр = Объект.ПоказателиПоСезонности.Добавить();
		НовСтр.Сезонность = Перечисления.Сезонность.Зима;
		
		НовСтр = Объект.ПоказателиПоСезонности.Добавить();
		НовСтр.Сезонность = Перечисления.Сезонность.Лето;
	КонецЕсли;
	
	//устанавливаем тумблер в положение "весь год"
	ЗаполнитьЗначенияСвойств(Объект,Объект.ПоказателиПоСезонности[0]);									 
	
КонецПроцедуры


&НаКлиенте
Процедура УдельныеПоказателиВыбросовЗагрязняющихВеществНажатие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 		
		Если Не Записать() Тогда 
			Возврат
		КонецЕсли;			
	КонецЕсли;	
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипГПА", Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УдельныеПоказателиВыбросовЗагрязняющихВеществГПА.ФормаСписка", ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор);
	
КонецПроцедуры // Процедура УдельныеПоказателиВыбросовЗагрязняющихВеществНажатие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

&НаКлиенте
Процедура лп_СезонностьПриИзменении(Элемент)
	
	//заполним из реквизитов в ТЧ, показатели по сезоности в зависимости от переключателя
	ЗаполнитьЗначенияСвойств(Объект.ПоказателиПоСезонности[ТекСостояниеСезонности],Объект);
	ТекСостояниеСезонности = лп_Сезонность;
	//заполним из ТЧ в реквизиты, показатели по сезоности в зависимости от переключателя
	ЗаполнитьЗначенияСвойств(Объект,Объект.ПоказателиПоСезонности[ТекСостояниеСезонности]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьЗначенияСвойств(Объект.ПоказателиПоСезонности[ТекСостояниеСезонности],Объект);
КонецПроцедуры

ТекСостояниеСезонности = 0;
