
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Лаборатория = Параметры.Лаборатория;
	Оборудование = Параметры.Оборудование;
	РегистрационныйНомер = Параметры.РегистрационныйНомер;
	ИнвентарныйНомер = Параметры.ИнвентарныйНомер;
	ЗаводскойНомер = Параметры.ЗаводскойНомер;
	ЗаводскоеОбозначение = Параметры.ЗаводскоеОбозначение;
	НомерПаспортаНаОборудование = Параметры.НомерПаспортаНаОборудование;
	ДатаИзготовления = Параметры.ДатаИзготовления;
	ДатаВводаВЭксплуатацию = Параметры.ДатаВводаВЭксплуатацию;
	СрокДопустимойЭксплуатации = Параметры.СрокДопустимойЭксплуатации;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.Период КАК ДатаПериодическойАттестации,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ДатаСледующейПоверки КАК СрокПоследующейАттестации,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.НомерСвидетельстваОПоверке,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ПроверяющаяОрганизация,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.СрокДействияСвидетельстваОПоверке
	|ИЗ
	|	РегистрСведений.лис_ПоверкиЛабораторногоОборудования.СрезПоследних(
	|			&Дата,
	|			ЛабораторноеОборудование = &ЛабораторноеОборудование
	|				И ИнвентарныйНомер = &ИнвентарныйНомер
	|				И РегистрационныйНомер = &РегистрационныйНомер
	|				И ЗаводскойНомер = &ЗаводскойНомер) КАК лис_ПоверкиЛабораторногоОборудованияСрезПоследних";
	Запрос.УстановитьПараметр("ЛабораторноеОборудование", Параметры.Оборудование);
	Запрос.УстановитьПараметр("РегистрационныйНомер", Параметры.РегистрационныйНомер);
	Запрос.УстановитьПараметр("ЗаводскойНомер", Параметры.ЗаводскойНомер);
	Запрос.УстановитьПараметр("ИнвентарныйНомер", Параметры.ИнвентарныйНомер);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерСвидетельстваОПоверке = Выборка.НомерСвидетельстваОПоверке;
		ДатаПоследнейПоверки = Выборка.ДатаПериодическойАттестации;
		ДатаПоследующейПоверки = Выборка.СрокПоследующейАттестации;
		ПроверяющаяОрганизация = Выборка.ПроверяющаяОрганизация;
		СрокДействияСвидетельстваОПоверке = Выборка.СрокДействияСвидетельстваОПоверке;
	КонецЕсли;	
	
КонецПроцедуры
