#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	Если ЗначениеЗаполнено(Параметры.ПроизводственнаяПлощадка) Тогда
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ПроизводственнаяПлощадка");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование    = Истина;
	    ЭлементОтбора.ПравоеЗначение   = Параметры.ПроизводственнаяПлощадка;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
