
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТабЧасть, "Ссылка", ТекСтрока.Ссылка);
		//СтруктураОтбора = Новый Структура("Ссылка", ТекСтрока.Ссылка);		
		//Элементы["ТабЧасть"].ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТабЧасть, "Ссылка", ПредопределенноеЗначение("Документ.лис_АктОтбораПроб.ПустаяСсылка"));
		//СтруктураОтбора = Новый Структура("Ссылка", ПредопределенноеЗначение("Документ.лис_АктОтбораПроб.ПустаяСсылка"));		
		//Элементы["ТабЧасть"].ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	КонецЕсли;
КонецПроцедуры
