#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	ЭлементОтбора					 = СписокПротоколов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения		 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение		 = Новый ПолеКомпоновкиДанных("МестоОтбора.ОбъектОтбораПроб.Водогоризонт");
	ЭлементОтбора.ПравоеЗначение	 = Объект.Ссылка;
	ЭлементОтбора.Использование		 = Истина;
	ЭлементОтбора.РежимОтображения	 = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

КонецПроцедуры

#КонецОбласти
