#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Установка отбора по организации и родителю.
	Если Параметры.Свойство("ОрганизацияДляОтбора") Или Параметры.Свойство("ОрганизацияДляОтбораЛУ") Тогда 																	  
		УстановитьОтборПоОрганизациям();
	КонецЕсли;			
			
КонецПроцедуры // Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоОрганизациям()
	
	Параметры.Отбор.Очистить();
	
	Список.Отбор.Элементы.Очистить();
	
	Группа = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Группа.Использование = Истина;
	Группа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
	
	Если Параметры.Свойство("ОрганизацияДляОтбора") Тогда 																	  
		лкОрганизацияДляОтбора = Параметры.ОрганизацияДляОтбора;
	ИначеЕсли Параметры.Свойство("ОрганизацияДляОтбораЛУ") Тогда
		лкОрганизацияДляОтбора = Параметры.ОрганизацияДляОтбораЛУ;
	КонецЕсли;
	
	лкВышестоящаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(лкОрганизацияДляОтбора, "Родитель");
	
	Если лкВышестоящаяОрганизация <> ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
		
		ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
		ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.Использование	= Истина;
		ЭлОтбора.ПравоеЗначение = лкВышестоящаяОрганизация;
		
	КонецЕсли; 
	
	ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.Использование	= Истина;
	ЭлОтбора.ПравоеЗначение = лкОрганизацияДляОтбора;
	
КонецПроцедуры

#КонецОбласти 